[
  {
    "link": "https://cnsmaryland.org/2025/06/02/germantown-senior-aims-for-2028-paralympics/",
    "title": "Germantown Senior Aims for 2028 Paralympics",
    "topic": "Sports",
    "tags": [
      "Lisa Markland",
      "Germantown MD",
      "2028 Paralympics",
      "Los Angeles"
    ],
    "summary": "Lisa Markland, a former top athlete from Germantown, MD, who had to step down before the 2008 Beijing Olympics, is making a comeback with her sights set on the 2028 Summer Paralympics in Los Angeles. Her journey back to competitive sports highlights her determination and resilience."
  },
  {
    "link": "https://cnsmaryland.org/2025/05/06/high-school-sports-and-nil-an-explainer/",
    "title": "High School Sports and NIL: An Explainer",
    "topic": "Sports",
    "tags": [
      "NIL Payments",
      "State Policies",
      "High School",
      "Shirley Povich",
      "Laura Shaughnessy"
    ],
    "summary": "A four-month investigation by the Shirley Povich Center for Sports Journalism explores how Name, Image and Likeness (NIL) payments are affecting high school sports, revealing a varied landscape of state policies. The video provides an overview of this complex issue, highlighting the significant changes brought about by NIL in high school athletics."
  },
  {
    "link": "https://cnsmaryland.org/2025/05/06/little-league-world-series-provides-big-stage-for-youth-athletes-but-its-nil-rules-are-murky/",
    "title": "Little League Baseball provides big stage for youth athletes but its NIL rules are murky",
    "topic": "Sports",
    "tags": [
      "Little League",
      "Williamsport",
      "NIL Deals",
      "Youth Athletes",
      "Lake Mary"
    ],
    "summary": "The Little League World Series, a significant event for youth baseball athletes, has attracted larger TV audiences than some major league games, raising questions about the potential for young players to capitalize on their fame through NIL deals. However, Little League has not yet established clear policies regarding NIL for its young participants, citing the need to protect their eligibility for high school sports."
  },
  {
    "link": "https://cnsmaryland.org/2025/05/06/impact-of-nil-on-transfers-is-unknown-but-raises-questions-for-high-school-officials/",
    "title": "Impact of NIL on transfers is unknown but raises questions for high school officials",
    "topic": "Sports",
    "tags": [
      "Washington D.C.",
      "DeMatha Catholic",
      "NIL Impact",
      "High School",
      "Transfers Concerns"
    ],
    "summary": "High-profile high school athlete transfers, including a star basketball player moving to a rival school, raise questions about the influence of Name, Image, and Likeness (NIL) compensation on recruitment, though no direct links have been established. High school officials and administrators are concerned about how NIL might be altering the landscape of student-athlete recruitment and retention."
  },
  {
    "link": "https://cnsmaryland.org/2025/05/06/for-college-hunks-portland-gear-high-school-athletes-are-star-endorsers/",
    "title": "For College HUNKS, Portland Gear, high school athletes are star endorsers",
    "topic": "Sports",
    "tags": [
      "Alexis Ewing",
      "College HUNKS",
      "NIL Deal",
      "Bullis School",
      "Penn State"
    ],
    "summary": "College HUNKS Hauling Junk & Moving signed a groundbreaking Name, Image, and Likeness deal with high school volleyball star Alexis Ewing, making her the first high school athlete in Maryland to secure such a deal. This move highlights the emerging trend of businesses exploring NIL opportunities with high school athletes despite the uncertainty and newness of the territory."
  },
  {
    "link": "https://cnsmaryland.org/2025/05/06/boom-in-nil-opportunities-exposes-need-for-education-for-athletes-and-their-parents/",
    "title": "Boom in NIL opportunities exposes need for education for athletes and their parents",
    "topic": "Sports",
    "tags": [
      "NIL Deals",
      "North Carolina",
      "Student-Athlete Insights",
      "Burlington Vermont",
      "Parent Education"
    ],
    "summary": "As more state high school athletic associations permit Name, Image, and Likeness (NIL) deals for athletes, the need for educating players and their families about these opportunities and the associated risks has become increasingly apparent. Only a few states, like North Carolina, have implemented mandatory education programs, leaving many athletes and parents to navigate NIL regulations on their own."
  },
  {
    "link": "https://cnsmaryland.org/2025/05/06/navigating-nil-a-patchwork-of-policies-governing-high-school-athletes/",
    "title": "Can high school athletes get NIL deals? It depends what state you’re in",
    "topic": "Sports",
    "tags": [
      "High school",
      "Athletes",
      "NIL deals",
      "State regulations",
      "Compensation restrictions"
    ],
    "summary": "High school athletes in 41 states and D.C. can be compensated for their name, image, and likeness (NIL), with restrictions on mentioning schools or teams and endorsements of certain products like tobacco and alcohol; however, regulations vary significantly across states, including differences in reporting requirements and eligibility criteria."
  },
  {
    "link": "https://cnsmaryland.org/2025/05/06/as-nil-comes-to-high-school-sports-its-impact-is-being-hotly-debated/",
    "title": "As NIL comes to high school sports, its impact is being hotly debated",
    "topic": "Sports",
    "tags": [
      "California",
      "NIL",
      "High School",
      "Fair Pay",
      "41 States"
    ],
    "summary": "California's Fair Pay to Play Act has expanded to allow high school athletes in 41 states and Washington, D.C. to earn money from their Name, Image, and Likeness (NIL), sparking debate over the professionalization of high school sports and potential unintended consequences."
  },
  {
    "link": "https://cnsmaryland.org/2025/04/16/fans-flock-to-nationals-opening-day/",
    "title": "Fans flock to Nationals Opening Day",
    "topic": "Sports",
    "tags": [
      "Washington D.C.",
      "Nationals",
      "Opening Day",
      "Fans",
      "Hope"
    ],
    "summary": "Opening Day in Washington D.C. brings renewed hope and excitement for Nationals fans after a tough 2024 season."
  },
  {
    "link": "https://cnsmaryland.org/2025/04/07/teenager-in-wheelchair-defies-odds-and-plays-lacrosse-2/",
    "title": "Teenager in wheelchair defies odds and plays lacrosse",
    "topic": "Sports",
    "tags": [
      "Caleb Krewson",
      "Wheelchair Athlete",
      "Severn School",
      "Coach Wolters",
      "Inspiration Team"
    ],
    "summary": "Caleb Krewson, a freshman lacrosse player in a wheelchair, scored his first high school goal, proving his athletic ability. His coach and teammates support him, focusing on his dedication and the inspiration he brings to the team."
  },
  {
    "link": "https://cnsmaryland.org/2025/03/29/allie-coyle-becomes-the-first-female-to-win-a-maryland-boys-soccer-state-title/",
    "title": "Allie Coyle becomes the first female to win a Maryland Boys’ Soccer State Title",
    "topic": "Sports",
    "tags": [
      "Allie Coyle",
      "Montgomery Blair",
      "Maryland Title",
      "First Female",
      "Gender Stereotypes"
    ],
    "summary": "Allie Coyle, the first female head coach of Montgomery Blair High School's boys’ soccer team, led them to win their first Maryland Boys’ Soccer State Title in over 50 years. Her achievement challenges gender stereotypes and inspires young women and athletes alike."
  },
  {
    "link": "https://cnsmaryland.org/2025/03/24/frances-tiafoe-gives-back-to-college-park-youth-tennis-center-via-charitable-fund/",
    "title": "Frances Tiafoe gives back to College Park youth tennis center via charitable fund",
    "topic": "Sports",
    "tags": [
      "Frances Tiafoe",
      "College Park",
      "JTCC",
      "Philanthropy",
      "Youth Programs"
    ],
    "summary": "Frances Tiafoe, a successful tennis player, launched the Frances Tiafoe Fund to support the Junior Tennis Champions Center in College Park, where he grew up, with an initial gift of $50,000. The fund aims to promote tennis programs and opportunities for underprivileged youth in Prince George’s County."
  },
  {
    "link": "https://cnsmaryland.org/2025/02/10/super-bowl-lix-how-kellen-moores-genius-game-plan-helped-eagles-to-dominant-win-vs-chiefs/",
    "title": "Super Bowl LIX: How Kellen Moore’s ‘genius’ game plan helped Eagles to dominant win vs. Chiefs",
    "topic": "Sports",
    "tags": [
      "Kellen Moore",
      "Philadelphia Eagles",
      "New Orleans",
      "Super Bowl",
      "Jalen Hurts"
    ],
    "summary": "Kellen Moore's strategic game plan and aggressive play-calling were pivotal in the Philadelphia Eagles' 40-22 victory over the Kansas City Chiefs in Super Bowl LIX. Despite facing challenges, Moore effectively exploited the Chiefs' defensive weaknesses, particularly through quarterback Jalen Hurts' running ability and precise passing to A.J."
  },
  {
    "link": "https://cnsmaryland.org/2025/02/07/super-bowl-lix-maryland-upbringing-set-stage-for-thomas-bookers-nfl-success/",
    "title": "Super Bowl LIX: Maryland upbringing set stage for Thomas Booker’s NFL success",
    "topic": "Sports",
    "tags": [
      "Thomas Booker",
      "Ellicott City",
      "Philadelphia Eagles",
      "NPR Listener",
      "Community Leader"
    ],
    "summary": "Thomas Booker, a defensive tackle for the Philadelphia Eagles from Ellicott City, Maryland, credits his unique upbringing—filled with intellectual discussions and a focus on academics—as key to his NFL success leading up to Super Bowl LIX. Despite his current achievements, Booker envisions a future beyond football, aiming to make significant impacts as a businessman and community leader."
  },
  {
    "link": "https://cnsmaryland.org/2024/12/12/lamar-jackson-jayden-daniels-and-the-new-landscape-for-black-quarterbacks/",
    "title": "Lamar Jackson, Jayden Daniels and the new landscape for Black quarterbacks",
    "topic": "Sports",
    "tags": [
      "Lamar Jackson",
      "Jayden Daniels",
      "Baltimore Ravens",
      "Washington Commanders",
      "NFL QBs"
    ],
    "summary": "In a historic NFL game, Lamar Jackson's Ravens defeated Jayden Daniels' Washington Commanders, showcasing two exceptional Black quarterbacks and setting the stage for Daniels as a promising rookie. The increasing presence of Black starting quarterbacks in the NFL, with 15 in the 2024 season, marks a significant shift from past years, reflecting broader changes in the league's landscape."
  },
  {
    "link": "https://cnsmaryland.org/2024/12/11/from-africa-pathways-to-the-nba/",
    "title": "From Africa: Pathways to the NBA",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Senegal",
      "Jenna Bloom",
      "Alexa Wootten"
    ],
    "summary": "\"From Africa: Pathways to the NBA\" is a documentary that showcases the journey of promising African basketball players at an academy in Senegal, highlighting their dedication both on and off the court as they chase their NBA dreams. Directed by Jenna Bloom and Alexa Wootten, the film also emphasizes the strong bond among the players and was produced with support from The Shirley Povich Center for Sports Journalism and Capital News Service."
  },
  {
    "link": "https://cnsmaryland.org/2024/12/06/chance-stephens-uses-cryotherapy-to-enhance-recovery-from-knee-injury/",
    "title": "Chance Stephens uses cryotherapy to enhance recovery from knee injury",
    "topic": "Sports",
    "tags": [
      "Chance Stephens",
      "Maryland Basketball",
      "Cryotherapy Recovery",
      "Knee Injury",
      "College Park"
    ],
    "summary": "Chance Stephens, a Maryland men's basketball player, is returning to the court after tearing his patellar tendon, aided by cryotherapy in his recovery."
  },
  {
    "link": "https://cnsmaryland.org/2024/10/30/caitlyn-phipps-begins-her-next-chapter-as-georgetown-universitys-new-head-coach/",
    "title": "Caitlyn Phipps begins her next chapter as Georgetown University’s new head coach",
    "topic": "Sports",
    "tags": [
      "Caitlyn Phipps",
      "Georgetown University",
      "NCAA Championships",
      "Tewaaraton Winners"
    ],
    "summary": "Caitlyn Phipps, who led the University of Maryland women’s lacrosse team to five NCAA championships over a decade, is starting a new phase in her career as the head coach at Georgetown University. Her impressive coaching and playing achievements make her a significant addition to the Georgetown program."
  },
  {
    "link": "https://cnsmaryland.org/2024/10/11/battle-of-the-beltway-what-to-expect-from-the-ravens-vs-commanders-game/",
    "title": "Battle of the Beltway: What to expect from the Ravens vs. Commanders game",
    "topic": "Sports",
    "tags": [
      "Baltimore",
      "Washington",
      "Lamar Jackson",
      "Jayden Daniels",
      "Derrick Henry"
    ],
    "summary": "The Ravens face the Commanders in a highly anticipated matchup, with Lamar Jackson aiming to outperform rookie sensation Jayden Daniels. Both quarterbacks have had strong starts to the season, making this game a must-watch event."
  },
  {
    "link": "https://cnsmaryland.org/2024/10/02/after-world-series-triumph-nats-suffer-an-historic-five-year-fade/",
    "title": "After World Series triumph, Nats suffer a historic five-year fade",
    "topic": "Sports",
    "tags": [
      "Washington Nationals",
      "Jarad Kopf",
      "World Series",
      "Commissioner’s Trophy",
      "Philadelphia Athletics"
    ],
    "summary": "The Washington Nationals, after winning the 2019 World Series, experienced a significant decline with a .407 winning percentage over the next five seasons, marking one of the worst post-championship slumps in baseball history. This historic fade is second only to the 1913 Philadelphia Athletics' .386 winning percentage from 1914-1918."
  },
  {
    "link": "https://cnsmaryland.org/2024/10/02/orioles-in-search-of-first-playoff-win-since-2014/",
    "title": "Orioles in search of first playoff win since 2014",
    "topic": "Sports",
    "tags": [
      "Baltimore Orioles",
      "Kansas City",
      "Playoff Return",
      "90-Win Season",
      "Fan Expectations"
    ],
    "summary": "The Baltimore Orioles, fresh off a 90-win regular season, aim for their first playoff victory since 2014 as they face the Kansas City Royals in the American League Wild Card game. The team seeks to advance beyond the playoffs after being swept last year."
  },
  {
    "link": "https://cnsmaryland.org/2024/08/07/from-d-c-to-dakar-basketball-connections-stretch-over-the-atlantic/",
    "title": "From D.C. to Dakar, basketball connections stretch over the Atlantic",
    "topic": "Sports",
    "tags": [
      "Amadou Fall",
      "DMV Connections",
      "BAL Growth",
      "African Basketball",
      "NBA Involvement"
    ],
    "summary": "The Basketball Africa League, spearheaded by Amadou Gallo Fall, a former University of District of Columbia player, aims to grow basketball across Africa with strong ties to the DMV area. Many key figures in African basketball, including coaches and officials, have connections to universities in the D.C., Maryland, and Virginia region."
  },
  {
    "link": "https://cnsmaryland.org/2024/07/02/nba-academy-africa-stresses-the-importance-of-fundamentals-when-it-comes-to-developing-talent/",
    "title": "NBA Academy Africa stresses fundamentals in developing talent",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Senegal",
      "Angola",
      "Basketball IQ",
      "Fundamentals"
    ],
    "summary": "NBA Academy Africa focuses on developing elite young basketball players from across the continent by emphasizing fundamental skills and Basketball IQ. Through patient, repetitive training, coaches teach players crucial defensive techniques and teamwork, preparing them for higher levels of play."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/19/how-nba-academy-africa-fuels-the-future-of-basketball/",
    "title": "How NBA Academy Africa fuels the future of basketball",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Gaetan Teumgue",
      "Senegal Cameroon",
      "Matong Muerwel",
      "Nutrition Training"
    ],
    "summary": "NBA Academy Africa is nurturing the continent's next basketball superstars by providing rigorous training, education, and tailored nutrition to 22 young athletes from 11 countries. Gaetan Teumgue Wafo, a 16-year-old Cameroonian player, exemplifies the academy’s impact with significant physical improvements due to proper nutrition and structured meals."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/17/nba-africa-newcomers-find-common-ground-in-unfamiliar-world/",
    "title": "NBA Academy Africa newcomers find common ground in unfamiliar world",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Senegal",
      "Conde",
      "Camboma",
      "Ivory Coast"
    ],
    "summary": "NBA Academy Africa brings together young basketball talents from across the continent, initially facing challenges like language barriers and loneliness. Through shared activities and team bonding, players like Zie Cheick Hassan Conde and Manuel Camboma overcome these obstacles, forming strong connections and improving their social and linguistic skills."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/13/five-things-to-know-about-the-nba-academy-africa/",
    "title": "Five things to know about the NBA Academy Africa",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Saly Senegal",
      "Player Development",
      "Notable Alumni"
    ],
    "summary": "The NBA Academy Africa, opened in Saly, Senegal in 2018, trains elite African basketball players for future careers. The facility highlights include its impact on player development and notable alumni."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/12/at-nba-academy-africa-a-commitment-to-supporting-the-youngest-players/",
    "title": "At NBA Academy Africa, a commitment to supporting the youngest players",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Seifeldin Hendawy",
      "Senegal Saly",
      "Loyola Chicago",
      "Africa Basketball"
    ],
    "summary": "NBA Academy Africa in Senegal recruits young basketball talents from across Africa, providing them with training and support as they pursue professional careers; Seifeldin Hendawy, one of the youngest players when he joined at 16, is now 18 and will play for Loyola Chicago next season."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/11/african-basketballs-changing-of-the-guard/",
    "title": "African basketball’s changing of the guard",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Seifeldin Hendawy",
      "Ahmed Bedoui",
      "Roland Houston",
      "Florida Atlantic"
    ],
    "summary": "NBA Academy Africa is nurturing a new generation of talented African basketball players, including guards who are breaking away from the traditional mold of tall African players. These young talents, like Seifeldin Hendawy and Ahmed Bedoui, are looking up to American players for inspiration as they aim to succeed at higher levels of the sport."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/10/bal-championship-playing-with-pride/",
    "title": "BAL Championship: Playing with pride",
    "topic": "Sports",
    "tags": [
      "Solo Diabate",
      "Carlos Morais",
      "Africa Representation",
      "BAL Championship"
    ],
    "summary": "Solo Diabate and Carlos Morais, prominent African basketball players, shared their pride in representing Africa during the BAL Championship Game. Their participation underscores the significance of playing for their continent."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/08/nba-finals-inspire-players-at-nba-africa-academy/",
    "title": "NBA Finals inspire players at NBA Academy Africa",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Senegal",
      "Players",
      "Inspiration",
      "Game One"
    ],
    "summary": "Players at the NBA Academy Africa in Senegal stayed up late to watch Game One of the NBA Finals, inspiring them with the opportunity to see top-tier basketball talent. Practices were adjusted to a later start time to accommodate this special viewing."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/07/club-rafiki-where-basketball-dreams-flourish/",
    "title": "Club Rafiki: Where basketball dreams flourish",
    "topic": "Sports",
    "tags": [
      "Kigali",
      "Rwanda",
      "Club Rafiki",
      "Free Access",
      "Children"
    ],
    "summary": "Club Rafiki in Kigali, Rwanda, offers free basketball access to children, fostering their sports dreams. The club features two courts that serve as both a gathering place and training area, established in 2022."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/07/watch-an-nba-finals-game-with-africas-top-basketball-talent/",
    "title": "Watch an NBA Finals Game with Africa’s top basketball prospects",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Senegal Watch",
      "Hendawy Camboma",
      "Kabugi Prospect",
      "SEED Partnership"
    ],
    "summary": "Top African basketball prospects from NBA Academy Africa gathered at 3 AM to watch Game One of the NBA Finals, analyzing the Celtics' victory over the Mavericks and discussing various players’ strategies and skills. Notable attendees included Seifeldin Hendawy, Manuel Camboma, and Joel Kabugi, each bringing a unique perspective on the game."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/06/baltimore-native-doesnt-let-disappointments-stand-in-the-way-of-his-basketball-career/",
    "title": "Baltimore native doesn’t let disappointments stand in the way of his basketball career",
    "topic": "Sports",
    "tags": [
      "Nick Faust",
      "Baltimore",
      "Championship",
      "Work Ethic"
    ],
    "summary": "Nick Faust, a Baltimore native with an NBA dream, overcame disappointments through his strong attitude and work ethic, leading him to a successful professional career. He recently clinched the Basketball Africa League Season Four Championship on June 1."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/06/african-born-nba-players-focus-on-advancing-the-game/",
    "title": "African-born NBA players focus on advancing the game",
    "topic": "Sports",
    "tags": [
      "African-born",
      "NBA",
      "Hakeem Olajuwan",
      "Joel Embiid",
      "Masai Ujiri"
    ],
    "summary": "The 2024 NBA season features 19 African-born players, with a total of 67 from the continent in the league’s history, including two MVPs. Former and current African NBA players are actively promoting basketball through the Basketball Africa League and mentoring young talent to advance the game for future generations."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/04/basketball-is-booming-in-africa-but-court-access-lags/",
    "title": "Basketball is booming in Africa, but court access lags",
    "topic": "Sports",
    "tags": [
      "Rwanda",
      "Kigali",
      "Club Rafiki",
      "Giants Africa",
      "Masai Ujiri"
    ],
    "summary": "Basketball's popularity is surging in Africa, particularly in Rwanda, but access to basketball courts remains limited despite initiatives like the Club Rafiki and Giants of Africa's efforts to build more facilities. The shortage of courts poses a significant challenge to the sport's growth, with local governments and organizations working to increase infrastructure to meet rising interest."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/04/bal-championship-a-long-time-coming/",
    "title": "BAL Championship: A long time coming",
    "topic": "Sports",
    "tags": [
      "Petro Luanda",
      "Carlos Morais",
      "BAL Championship",
      "Rwanda"
    ],
    "summary": "Petro de Luanda, an Angolan basketball team, finally won the BAL Championship after competing since 2021, defeating Al Ahly Ly from Libya with a score of 107-94. This victory marked a significant moment for the team, especially for captain Carlos Morais."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/04/from-drums-to-dancing-bal-fans-bring-passion-to-finals/",
    "title": "From drums to dancing, BAL fans bring passion to finals",
    "topic": "Sports",
    "tags": [
      "Kigali",
      "Rwanda",
      "BAL",
      "Drums",
      "Dancing"
    ],
    "summary": "At the Basketball Africa League finals in Kigali, Rwanda, fans animated the BK Arena with drumming, dancing, and chanting, blending African culture with basketball enthusiasm. The vibrant atmosphere showcased the deep passion of BAL supporters."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/03/five-things-to-know-about-the-basketball-africa-league/",
    "title": "Five things to know about the Basketball Africa League",
    "topic": "Sports",
    "tags": [
      "Africa League",
      "Women's Program",
      "2021 Launch",
      "Finals Path"
    ],
    "summary": "The Basketball Africa League, launched in 2021, is now Africa's top basketball league, featuring a structured path to the finals and initiatives to support women in basketball."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/02/basketball-in-africa/",
    "title": "Basketball in Africa",
    "topic": "Sports",
    "tags": [
      "Africa",
      "NBA",
      "FIBA",
      "Community",
      "Youth"
    ],
    "summary": "Basketball is gaining popularity across Africa, fostering community development and providing youth with positive role models and opportunities. Initiatives by organizations like the NBA and FIBA are crucial in supporting infrastructure and talent development on the continent."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/02/five-things-to-know-about-sports-in-rwanda/",
    "title": "Five Things to Know About Sports in Rwanda",
    "topic": "Sports",
    "tags": [
      "Rwanda",
      "Cycling",
      "Healing",
      "Soccer"
    ],
    "summary": "Rwanda leverages soccer for healing and will host the Road Cycling World Championships in 2025, highlighting its growing sports scene."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/01/baltimore-to-angola-nick-fausts-basketball-journey/",
    "title": "Baltimore to Angola: Nick Faust’s Basketball Journey",
    "topic": "Sports",
    "tags": [
      "Baltimore",
      "Angola",
      "Nick Faust",
      "Petro Luanda",
      "Championship"
    ],
    "summary": "Nick Faust, a former Baltimore high school basketball star, led Petro de Luanda to victory in the Basketball Africa League championship, scoring 24 points and securing his first professional title. Reflecting on his journey, Faust credits his tough upbringing in Baltimore for preparing him for the challenges he faced as a professional player in multiple countries."
  },
  {
    "link": "https://cnsmaryland.org/2024/06/01/for-elite-youth-basketball-players-leaving-africa-isnt-the-only-option-anymore/",
    "title": "For elite youth basketball players, leaving Africa isn’t the only option anymore",
    "topic": "Sports",
    "tags": [
      "NBA Academy",
      "Kigali Rwanda",
      "Festus Ezeli",
      "Saly Senegal",
      "Ugonna Onyenso"
    ],
    "summary": "NBA Academy Africa is providing elite youth basketball players on the continent with high-quality training and coaching, allowing them to develop closer to home rather than moving to the United States. This initiative has led to increased representation of African players in U.S."
  },
  {
    "link": "https://cnsmaryland.org/2024/05/11/beau-brade-stays-home-after-going-undrafted-in-nfl-draft/",
    "title": "Beau Brade stays home after going undrafted in NFL Draft",
    "topic": "Sports",
    "tags": [
      "Beau Brade",
      "Baltimore Ravens",
      "Maryland safety",
      "Hometown team"
    ],
    "summary": "Beau Brade, an undrafted Maryland safety, will play for the Baltimore Ravens, fulfilling his dream of playing for his hometown team. This marks another instance of Brade choosing to stay close to home."
  },
  {
    "link": "https://cnsmaryland.org/2024/05/07/jackson-hollidays-early-mlb-struggles-were-historic-among-top-draft-picks/",
    "title": "Jackson Holliday’s early MLB struggles were historic among top draft picks",
    "topic": "Sports",
    "tags": [
      "Jackson Holliday",
      "Baltimore Orioles",
      "Triple-A Norfolk",
      "Mike Elias",
      "Draft Pick"
    ],
    "summary": "Jackson Holliday, the top draft pick of 2022 by the Baltimore Orioles, was demoted to Triple-A after a historically poor start in the majors, hitting just .059 over his first 10 games. Despite his minor league success, Holliday's major league struggles highlighted the challenges of adjusting to big league pitching."
  },
  {
    "link": "https://cnsmaryland.org/2024/05/02/examining-the-all-important-blueprint-of-quarterback-development/",
    "title": "Examining the all-important blueprint of quarterback development",
    "topic": "Sports",
    "tags": [
      "NFL Draft",
      "Quarterbacks",
      "Chicago Bears",
      "Washington Commanders"
    ],
    "summary": "The 2024 NFL Draft saw six quarterbacks selected within the top 12 picks, highlighting the critical importance of finding a franchise quarterback, though the success of these prospects remains highly uncertain and dependent on both their talent and team support. Teams like Chicago, Washington, New England, Atlanta, Minnesota, and Denver are banking on these young quarterbacks to provide a significant competitive advantage during their rookie contracts, given the quarterback's pivotal role in the offense-driven NFL."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/30/two-maryland-coaches-bring-knowledge-and-love-for-their-alma-mater-to-their-program/",
    "title": "Two Maryland coaches bring knowledge and love for their alma mater to their program",
    "topic": "Sports",
    "tags": [
      "Caitlyn Phipps",
      "Nadine Hadnagy",
      "Maryland Lacrosse",
      "College Park",
      "Alma Mater"
    ],
    "summary": "Caitlyn Phipps and Nadine Hadnagy, former Maryland women’s lacrosse stars, are now coaches who bring both their deep understanding of the game and a strong affection for their alma mater to their roles. Their passion for the program is a significant asset as they lead the team."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/30/maryland-football-quarterbacks-battle-in-annual-spring-game-in-search-of-new-starter/",
    "title": "Maryland football quarterbacks battle in annual Spring Game in search of new starter",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Taulia Tagovailoa",
      "Billy Edwards",
      "Cam Edge",
      "MJ Morris"
    ],
    "summary": "Maryland football seeks a new quarterback leader following Taulia Tagovailoa's departure, with Billy Edwards, Jr., Cam Edge, and transfer MJ Morris competing in the Red vs. White Spring game."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/23/maryland-colleges-have-produced-over-300-nfl-draft-picks/",
    "title": "Maryland colleges have produced over 300 NFL Draft picks",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Terrapins",
      "Beau Brade",
      "Taulia Tagovailoa",
      "University Maryland"
    ],
    "summary": "Maryland colleges, especially the University of Maryland, College Park, have produced 319 NFL Draft picks since 1936, with 70% being former Terrapins. This year, while none of the top prospects are from Maryland, players like Beau Brade and Taulia Tagovailoa could be selected in later rounds."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/18/the-university-of-maryland-and-johns-hopkins-university-mens-lacrosse-rivalry-runs-deep/",
    "title": "The University of Maryland and Johns Hopkins University men’s lacrosse rivalry runs deep",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Johns Hopkins",
      "The Rivalry",
      "Lacrosse",
      "Bragging Rights"
    ],
    "summary": "This Saturday, Maryland and Johns Hopkins men’s lacrosse teams will compete in their storied rivalry, known as “The Rivalry,” which is the oldest in the sport. The matchup, driven by deep-seated competitiveness and pride, promises another intense clash for bragging rights."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/18/maryland-basketball-games-can-look-empty-inside-the-cavernous-xfinity-center/",
    "title": "Maryland basketball games can look empty inside the cavernous Xfinity Center",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Xfinity Center",
      "Rutgers",
      "Purdue",
      "Iowa"
    ],
    "summary": "Maryland's men’s and women’s basketball teams faced sparse crowds this season, with the men’s team recording a losing record for only the second time since 1993. Despite having one of the largest arenas in the Big Ten, Xfinity Center struggled to fill its nearly 18,000 seats, affecting the overall game atmosphere."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/17/basketball-in-africa-video/",
    "title": "Basketball in Africa video",
    "topic": "Sports",
    "tags": [
      "Africa",
      "Basketball",
      "Youth",
      "Community",
      "Empowerment"
    ],
    "summary": "The video highlights the growing popularity of basketball across Africa, showcasing vibrant community engagement and youth development programs. It emphasizes the sport's potential to inspire positive social change and empower young Africans."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/11/new-plans-to-rebuild-pimlico-race-course/",
    "title": "Pimlico Race Course, home of the Preakness, will undergo a 3-year renovation",
    "topic": "Sports",
    "tags": [
      "Pimlico Race",
      "Maryland Lawmakers",
      "Stronach Group",
      "Baltimore City",
      "New Track"
    ],
    "summary": "Maryland lawmakers have approved legislation for a three-year renovation of Pimlico Race Course, including a new track and additional facilities. The Stronach Group will transfer ownership to the state for this redevelopment project."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/10/umd-club-rugby-experiences-once-in-a-lifetime-trip-to-spain/",
    "title": "UMD Club Rugby experiences once in a lifetime trip to Spain",
    "topic": "Sports",
    "tags": [
      "UMD Rugby",
      "Spain Trip",
      "Cultural Exchange",
      "Team Bonding",
      "European Styles"
    ],
    "summary": "The University of Maryland’s Club Rugby team traveled to Spain, providing its athletes with an opportunity to explore a new culture and understand different styles of European rugby. This unique trip enhanced their team bonding and broadened their global perspectives."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/09/maryland-and-morgan-state-football-programs-partner-for-baltimore-day/",
    "title": "Maryland and Morgan State football programs partner for Baltimore Day",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Morgan State",
      "Hughes Stadium",
      "Mike Locksley",
      "Damon Wilson"
    ],
    "summary": "Maryland and Morgan State football teams partnered for \"Baltimore Day,\" holding separate practice sessions at Hughes Stadium to celebrate and promote the sport in the Maryland community, led by head coaches Mike Locksley and Damon Wilson."
  },
  {
    "link": "https://cnsmaryland.org/2024/04/04/maryland-mens-basketball-top-recruit-earns-co-mvp-at-mcdonalds-all-american-games/",
    "title": "Maryland men’s basketball top recruit earns co-mvp at McDonald’s All American Games",
    "topic": "Sports",
    "tags": [
      "Derik Queen",
      "Baltimore native",
      "McDonald’s Game",
      "Maryland recruit",
      "Houston TX"
    ],
    "summary": "Derik Queen, a Baltimore native and top recruit for Maryland men’s basketball, was named co-MVP at the McDonald’s All-American Boys’ Game on April 2. Despite the high expectations, Queen remains unfazed by the pressure."
  },
  {
    "link": "https://cnsmaryland.org/2024/03/29/high-anticipation-for-the-orioles-on-opening-day/",
    "title": "High anticipation for the Orioles on Opening Day",
    "topic": "Sports",
    "tags": [
      "Baltimore Orioles",
      "Oriole Park",
      "New Ownership",
      "Top Prospect",
      "Starting Pitcher"
    ],
    "summary": "The Baltimore Orioles kick off their season at Oriole Park with high hopes after their best performance in 40 years and a new ownership. They start defending their American League East Championship with the addition of a top prospect and a new starting pitcher."
  },
  {
    "link": "https://cnsmaryland.org/2024/03/27/sellouts-and-snowstorms-the-history-of-opening-day-in-baltimore/",
    "title": "Sellouts and snowstorms: The history of Opening Day in Baltimore",
    "topic": "Sports",
    "tags": [
      "Baltimore",
      "Orioles",
      "Camden Yards",
      "Corbin Burnes"
    ],
    "summary": "Baltimore's Opening Day is a beloved tradition, with Camden Yards often selling out despite variable weather conditions. This year, the Orioles, fresh off a 101-win season and featuring new starting pitcher Corbin Burnes, aim to build on their World Series contender status against the Los Angeles Angels."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/29/the-ravens-fourth-quarter-turnover-rate-soars-in-the-playoffs/",
    "title": "The Ravens’ fourth-quarter turnover rate soars in the playoffs",
    "topic": "Sports",
    "tags": [
      "Baltimore Ravens",
      "John Harbaugh",
      "Lamar Jackson",
      "Kansas City",
      "Playoffs"
    ],
    "summary": "The Baltimore Ravens' fourth-quarter turnover rate significantly increases in playoff games, contributing to their recent loss to the Kansas City Chiefs and hindering their Super Bowl aspirations. This trend has persisted throughout John Harbaugh's tenure as head coach, with the team committing 98% more turnovers per game in the fourth quarter during the playoffs compared to the regular season."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/27/miller-brothers-close-bond-with-head-coach-alex-clemsen-has-made-all-the-difference/",
    "title": "Miller brothers close bond with head coach Alex Clemsen has made all the difference",
    "topic": "Sports",
    "tags": [
      "Kal Miller",
      "Ethen Miller",
      "Alex Clemsen",
      "University Maryland",
      "Missouri Connection"
    ],
    "summary": "Kal and Ethen Miller, wrestling for the University of Maryland, have a strong bond with head coach Alex Clemsen, who they've known since childhood. This close relationship has extended to Clemsen helping the brothers launch their own NIL clothing brand."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/12/mahomes-chiefs-outlast-49ers-to-claim-back-to-back-super-bowls/",
    "title": "Mahomes, Chiefs outlast 49ers to claim back-to-back Super Bowls",
    "topic": "Sports",
    "tags": [
      "Mahomes",
      "Chiefs",
      "49ers",
      "Hardman",
      "Reid"
    ],
    "summary": "The Kansas City Chiefs, led by quarterback Patrick Mahomes, overcame early struggles and a 10-0 deficit to defeat the San Francisco 49ers 25-22 in overtime, winning their third Super Bowl title in five years and second consecutive one. The decisive touchdown came from a three-yard pass to Mecole Hardman, securing the Chiefs' place as the first back-to-back Super Bowl champions since the New England Patriots in 2003-4."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/06/youth-tackle-football-balancing-risks-and-rewards-depends-on-race-and-place/",
    "title": "Youth Tackle Football: Balancing risks and rewards depends on race and place",
    "topic": "Sports",
    "tags": [
      "Youth Football",
      "Parental Decisions",
      "Racial Factors",
      "Geographical Influence",
      "Opportunity Communities"
    ],
    "summary": "Youth participation in tackle football is declining due to health concerns, but a new investigation reveals that parental decisions on children's involvement in the sport are influenced by racial and geographical factors, highlighting how tackle football remains an opportunity in many communities."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/05/when-families-love-of-the-game-conflicts-with-the-science/",
    "title": "When families’ love of the game conflicts with the science",
    "topic": "Sports",
    "tags": [
      "Youth Football",
      "Black Parents",
      "Hispanic Parents",
      "College Scholarships",
      "NFL Careers"
    ],
    "summary": "Youth tackle football participation is declining as families weigh the risks of injury against potential opportunities, but in communities of color, particularly among Black and Hispanic parents, the sport's appeal remains strong due to perceived benefits like scholarships and pro careers. Despite awareness of injury risks, some youth football leaders believe the sport's positive impacts outweigh the dangers."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/05/poll-black-hispanic-parents-nearly-twice-as-likely-as-white-parents-to-see-youth-football-as-a-path-to-college-scholarships-nfl/",
    "title": "Poll: Black, Hispanic parents nearly twice as likely as white parents to see youth football as a path to college scholarships, NFL",
    "topic": "Sports",
    "tags": [
      "Black parents",
      "Hispanic parents",
      "Ipsos poll",
      "College scholarships",
      "NFL path"
    ],
    "summary": "Black and Hispanic parents are nearly twice as likely as white parents to view youth football as a path to college scholarships and the NFL, despite general agreement on its social and physical benefits among all races. Most parents would still allow their children to play tackle football, recognizing the health risks involved."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/05/with-few-other-options-football-is-hope-for-families-in-rural-mississippi/",
    "title": "With few other options, football is hope for families in rural Mississippi",
    "topic": "Sports",
    "tags": [
      "Lexington",
      "Mississippi",
      "College",
      "Scholarships",
      "Poverty"
    ],
    "summary": "In rural Mississippi, football remains a crucial activity for young boys, offering a path to college and potential escape from poverty despite limited recreational options and safety concerns. Despite the challenges, three players from the small town of Lexington have made it to elite college programs, highlighting the sport's significance as a beacon of hope in the community."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/05/in-an-atlanta-suburb-youth-football-is-a-way-of-life/",
    "title": "In an Atlanta suburb, youth football is a way of life",
    "topic": "Sports",
    "tags": [
      "Buford",
      "Gwinnett",
      "McDonald",
      "Head injuries",
      "Youth leagues"
    ],
    "summary": "In Buford, Georgia, youth football is a cherished tradition despite the risks of head injuries, with over 3,200 children participating in the Gwinnett Football League in 2023. Parents and coaches acknowledge the dangers but believe the benefits outweigh the risks, as seen in A J McDonald’s commitment to letting his son play, even after experiencing concussions himself."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/05/why-lexington-mississippi-embraces-youth-tackle-football/",
    "title": "Video: Why Lexington, Mississippi embraces youth tackle football",
    "topic": "Sports",
    "tags": [
      "Lexington",
      "Mississippi",
      "Paul Reeves",
      "Youth Football",
      "Community Highlight"
    ],
    "summary": "Lexington, Mississippi, despite being in one of the poorest areas of the country, boasts a high per capita production of college football players from Power 5 schools. Football serves as a vital community highlight and opportunity for youth in this small town."
  },
  {
    "link": "https://cnsmaryland.org/2024/02/05/about-this-project/",
    "title": "About this project",
    "topic": "Sports",
    "tags": [
      "University Maryland",
      "Parent Decisions",
      "Brain Injuries",
      "Race Location",
      "Opportunity Communities"
    ],
    "summary": "A University of Maryland investigation explores the complex decisions parents make regarding their children's participation in tackle football, highlighting variations based on race and location, despite growing concerns over brain injuries. The project, involving extensive interviews and a national poll, also underscores the sport’s role as an opportunity in many communities."
  },
  {
    "link": "https://cnsmaryland.org/2023/12/05/emma-hayes-successful-career-leads-to-her-uswnt-head-coach-appointment/",
    "title": "Emma Hayes’ successful career leads to her USWNT head coach appointment",
    "topic": "Sports",
    "tags": [
      "Emma Hayes",
      "USWNT",
      "Chelsea",
      "WSL",
      "FA Cups"
    ],
    "summary": "Emma Hayes, a highly decorated coach who led Chelsea to numerous titles including six WSL championships and multiple FA Cups, has been appointed as the new head coach of the U.S. women’s national team."
  },
  {
    "link": "https://cnsmaryland.org/2023/12/01/maryland-womens-basketball-fueled-by-assist-to-turnover-ratio/",
    "title": "Maryland women’s basketball fueled by assist-to-turnover ratio",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Frese",
      "Xfinity Center",
      "Elite Eight",
      "Assist-to-Turnover Ratio"
    ],
    "summary": "Maryland women’s basketball team emphasizes the importance of a high assist-to-turnover ratio for winning games, as demonstrated by their strong performance and 1.2 ratio last season which contributed to 28 wins and an Elite Eight appearance. Coach Brenda Frese stresses that maximizing possessions and maintaining good offensive chemistry are crucial for achieving this ratio."
  },
  {
    "link": "https://cnsmaryland.org/2023/10/28/for-high-school-athletes-in-maryland-and-beyond-its-early-days-for-nil/",
    "title": "For high school athletes in Maryland and beyond, it’s early days for NIL",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "NIL",
      "Ewing",
      "Bullis",
      "College Hunks"
    ],
    "summary": "Maryland changed its rules in December 2022 to allow high school athletes to profit from Name, Image, and Likeness (NIL) deals, with Alexis Ewing becoming one of the first to sign such a deal as a spokesperson for College Hunks Hauling Junk & Moving. A recent poll shows that while 54% of adults support high school athletes earning money through NIL deals, only 15% have seen a high school athlete endorse products or services."
  },
  {
    "link": "https://cnsmaryland.org/2023/10/28/poll-nil-deals-for-high-school-athletes-favored-by-most-support-is-greater-among-blacks/",
    "title": "Poll: NIL deals for high school athletes favored by most; support is greatest among Blacks and Hispanics.",
    "topic": "Sports",
    "tags": [
      "High school",
      "Black support",
      "Hispanic approval",
      "NIL deals",
      "Endorsements"
    ],
    "summary": "A majority of Americans support high school athletes earning money through endorsement deals, with the highest support among Black and Hispanic respondents. However, there is less support for youth athletes before high school to profit from endorsements."
  },
  {
    "link": "https://cnsmaryland.org/2023/10/19/baltimore-city-produces-the-most-division-i-womens-basketball-players-in-maryland/",
    "title": "Baltimore City produces the most Division I women’s basketball players in Maryland",
    "topic": "Sports",
    "tags": [
      "Baltimore City",
      "Angel Reese",
      "Maryland",
      "DMV",
      "Brenda Frese"
    ],
    "summary": "Baltimore City leads Maryland as the top producer of Division I women’s basketball players, with 22 athletes last season, including LSU's national champion Angel Reese. Maryland women’s basketball head coach Brenda Frese emphasizes the exceptional talent from the DMV area, noting that 133 players from 67 towns and cities in Maryland competed at the Division I level last year."
  },
  {
    "link": "https://cnsmaryland.org/2023/10/13/fairfax-county-middle-schools-have-school-sports-for-the-first-time/",
    "title": "Fairfax County middle schools have school sports for the first time",
    "topic": "Sports",
    "tags": [
      "Fairfax County",
      "Middle Schools",
      "Cross Country",
      "Saturday Meets"
    ],
    "summary": "Fairfax County introduced middle school sports this fall, with all schools offering cross country. Students can participate in Saturday morning meets against other schools."
  },
  {
    "link": "https://cnsmaryland.org/2023/10/13/the-washington-capitals-get-ready-to-drop-the-puck-on-the-2023-24-season/",
    "title": "The Washington Capitals get ready to drop the puck on the 2023-24 season",
    "topic": "Sports",
    "tags": [
      "Washington",
      "Capitals",
      "NHL",
      "Season",
      "Start"
    ],
    "summary": "The Washington Capitals are set to kick off their 2023-24 season just three days after the NHL's official start, with coaches and players eagerly anticipating the beginning of the games."
  },
  {
    "link": "https://cnsmaryland.org/2023/10/10/as-laurel-park-readies-for-maryland-million-experts-discuss-safety-of-troubled-sport/",
    "title": "As Laurel Park readies for Maryland Million, experts discuss safety of troubled sport",
    "topic": "Sports",
    "tags": [
      "Laurel Park",
      "Maryland Million",
      "Horse Safety",
      "John Passero",
      "Alan Foreman"
    ],
    "summary": "Laurel Park is set to host the Maryland Million amid recent safety concerns and implemented recommendations following a temporary shutdown due to horse deaths. Despite these measures, the sport continues to face criticism over its safety record, with multiple high-profile incidents both locally and nationally."
  },
  {
    "link": "https://cnsmaryland.org/2023/09/19/capitals-evaluate-prospects-look-to-the-future-at-rookie-camp/",
    "title": "Capitals evaluate prospects, look to the future at rookie camp",
    "topic": "Sports",
    "tags": [
      "Capitals",
      "Prospects",
      "Arlington",
      "Annapolis",
      "Hershey Bears"
    ],
    "summary": "The Washington Capitals held their rookie camp over the weekend at various locations, focusing on intense skill development and preparation for the upcoming season. Notable prospects like Andrew Cristall and Hendrix Lapierre participated, engaging with excited fans and showcasing their talents through rigorous drills."
  },
  {
    "link": "https://cnsmaryland.org/2023/09/18/about-the-povich-center/",
    "title": "About The Povich Center",
    "topic": "Sports",
    "tags": [
      "Shirley Povich",
      "Washington Post",
      "Race Gender",
      "Experiential Curriculum"
    ],
    "summary": "The Shirley Povich Center for Sports Journalism equips students to lead in sports media through an innovative, experiential curriculum. It also fosters discussions on critical issues like race, gender, and politics, reflecting Shirley Povich's legacy at The Washington Post."
  },
  {
    "link": "https://cnsmaryland.org/2023/09/15/capitals-to-hold-rookie-camp-at-mcmullen-arena-in-annapolis/",
    "title": "Capitals to hold rookie camp at McMullen Arena in Annapolis",
    "topic": "Sports",
    "tags": [
      "Washington Capitals",
      "McMullen Arena",
      "Annapolis Mayor",
      "Spencer Carbery",
      "Capitals Roster"
    ],
    "summary": "The Washington Capitals are holding their 2023 Rookie Camp at McMullen Arena in Annapolis, marking their return to the city since 2018 and offering local fans free access to practices. New head coach Spencer Carbery emphasizes the importance of younger players in providing cap relief and contributing to the team's roster for the upcoming season."
  },
  {
    "link": "https://cnsmaryland.org/2023/07/06/new-hagerstown-stadium-brings-a-whole-new-ballgame-to-the-city/",
    "title": "Hagerstown’s new ballpark: Picnic areas, walking paths and high expectations",
    "topic": "Sports",
    "tags": [
      "Hagerstown",
      "Ballpark",
      "Atlantic League",
      "Downtown",
      "Construction"
    ],
    "summary": "Hagerstown is constructing a new 3,000-seat ballpark in downtown, set to open in spring 2024 and host an Atlantic League expansion team, reflecting the city's deep baseball history. The team name, chosen from five finalists including Battle Swans and Diezel Dogs, will be announced on July 20."
  },
  {
    "link": "https://cnsmaryland.org/2023/07/06/could-new-baseball-team-bring-little-league-spirit-back-to-hagerstown/",
    "title": "Could new baseball team bring Little League spirit back to Hagerstown?",
    "topic": "Sports",
    "tags": [
      "Hagerstown",
      "Little League",
      "Sam Croteau",
      "Atlantic League",
      "Suns"
    ],
    "summary": "Hagerstown, a town with a rich Little League history, saw its passion for baseball decline after the disbandment of its professional team in 2020 and a significant drop in youth league participation. Reintroducing a professional team could revive interest and foster new community connections, similar to the positive impact the former Hagerstown Suns had on local youth baseball."
  },
  {
    "link": "https://cnsmaryland.org/2023/07/06/big-dreams-for-small-town-baseball-owners-of-new-team-have-deep-roots-in-hagerstown/",
    "title": "Big dreams for small-town baseball: Owners of new team have deep roots in Hagerstown",
    "topic": "Sports",
    "tags": [
      "Hagerstown",
      "Local Owners",
      "Community Revitalization",
      "Minor League",
      "Deep Roots"
    ],
    "summary": "Hagerstown's new baseball team is owned by local investors deeply committed to revitalizing the city through the sport, despite the challenges of sustaining a minor league team in a small town. Their strategy mirrors successful teams with local ownership, emphasizing community ties and long-term commitment."
  },
  {
    "link": "https://cnsmaryland.org/2023/07/06/atlantic-league-founder-brings-hagerstown-into-his-baseball-petri-dish/",
    "title": "Atlantic League founder brings Hagerstown into his baseball ‘Petri dish’",
    "topic": "Sports",
    "tags": [
      "Frank Boulton",
      "Hagerstown",
      "Atlantic League",
      "Howard Bowen",
      "Independent Team"
    ],
    "summary": "Frank Boulton, founder of the Atlantic League of Professional Baseball, has partnered with Howard “Blackie” Bowen and others to bring a new independent league baseball team to Hagerstown, filling a gap since the city lost its previous team in 2021. Boulton's involvement is crucial as he brings extensive experience in managing minor league teams, having owned stakes in several over the past three decades."
  },
  {
    "link": "https://cnsmaryland.org/2023/05/21/the-preakness-was-under-the-spotlight-after-deaths-at-churchill-downs-earlier-this-month/",
    "title": "The Preakness was under the spotlight after deaths at Churchill Downs earlier this month",
    "topic": "Sports",
    "tags": [
      "Pimlico Race",
      "Havnameltdown",
      "Horseracing Wrongs",
      "Churchill Downs",
      "Luis Saez"
    ],
    "summary": "Protesters from Horseracing Wrongs gathered outside Pimlico Race Course during the Preakness Stakes, highlighting the industry's lethal nature following several recent horse deaths, including one on race day. The incident and prior fatalities at Churchill Downs reignited debates over the safety and ethics of horse racing."
  },
  {
    "link": "https://cnsmaryland.org/2023/05/19/charting-the-elite-statistical-performances-of-the-2023-ncaa-lacrosse-season/",
    "title": "Charting the Elite Statistical Performances of the 2023 NCAA Lacrosse Season",
    "topic": "Sports",
    "tags": [
      "Duke",
      "Williams",
      "NCAA",
      "Journalism",
      "Parity"
    ],
    "summary": "The 2023 NCAA lacrosse season saw a significant shift with new teams emerging and increased parity, leading to unexpected eliminations of last year’s Final Four teams. A comprehensive database project at the Philip Merrill College of Journalism now allows users to explore detailed individual player statistics, highlighting top performances like Duke’s Dyson Williams, who scored 54 goals with only 4 assists."
  },
  {
    "link": "https://cnsmaryland.org/2023/05/09/baltimore-orioles-international-scouting-diversity-changes/",
    "title": "Orioles’ international scouting strategy initiates shifts in team characteristics",
    "topic": "Sports",
    "tags": [
      "Baltimore Orioles",
      "International Scouting",
      "Non-American Players",
      "Mike Elias",
      "Delmarva Shorebirds"
    ],
    "summary": "The Baltimore Orioles are shifting their player makeup with an increased focus on non-American players in their minor league affiliates, a change driven by new leadership and scouting strategies since 2018. This shift aims to build a robust international talent pipeline from the lowest levels of the minors up to the major league team."
  },
  {
    "link": "https://cnsmaryland.org/2023/05/04/coaching-turnover-has-increased-in-mls-some-top-european-leagues/",
    "title": "Coaching turnover has increased in MLS, some top European leagues",
    "topic": "Sports",
    "tags": [
      "Christian Streich",
      "La Liga",
      "Serie A",
      "Major League",
      "Bundesliga"
    ],
    "summary": "SC Freiburg coach Christian Streich highlighted the intense pressure and high turnover rates among football managers, particularly in Major League Soccer and three of Europe’s top five leagues since 1996. La Liga and Serie A have seen the most coaching changes, with 561 and 551 respectively, while the MLS has had the fewest at 192 since its inception."
  },
  {
    "link": "https://cnsmaryland.org/2023/05/02/historically-successful-ucla-gymnastics-faces-challenges-in-move-to-big-ten/",
    "title": "Historically successful UCLA gymnastics faces challenges in move to Big Ten",
    "topic": "Sports",
    "tags": [
      "UCLA",
      "Big Ten",
      "NCAA",
      "Janelle McDonald",
      "Michigan"
    ],
    "summary": "UCLA women’s gymnastics, with seven NCAA titles, is set to join the Big Ten in 2024, marking a shift from Pac-12 rivals to new conference opponents. The move brings additional strength and excitement to the Big Ten, as UCLA consistently outperformed most Big Ten teams in recent years."
  },
  {
    "link": "https://cnsmaryland.org/2023/04/28/former-terrapin-taylor-cummings-is-a-color-commentator-for-maryland-womens-lacrosse/",
    "title": "Former Terrapin Taylor Cummings is a color commentator for Maryland women’s lacrosse",
    "topic": "Sports",
    "tags": [
      "Taylor Cummings",
      "Maryland Lacrosse",
      "Big Ten",
      "Commentator Role",
      "College Park"
    ],
    "summary": "Taylor Cummings, a former top-ranked player and coach, now serves as a color commentator for Maryland women’s lacrosse on The Big Ten Network. Her insights enhance the broadcast, drawing from her extensive experience in the sport."
  },
  {
    "link": "https://cnsmaryland.org/2023/04/28/maryland-pitcher-courtney-wyche-started-her-own-pitching-camp-where-she-coaches-young-girls/",
    "title": "Maryland pitcher Courtney Wyche started her own pitching camp where she coaches young girls",
    "topic": "Sports",
    "tags": [
      "Courtney Wyche",
      "Maryland Pitcher",
      "Coaching Girls",
      "Pitching Camp",
      "Self-Taught Skills"
    ],
    "summary": "Courtney Wyche, a pitcher from Maryland, has launched a pitching camp with her father, where she and her teammates coach high school girls. Her passion for teaching stems from her early self-taught experiences in pitching, which began at age 10."
  },
  {
    "link": "https://cnsmaryland.org/2023/04/27/new-rules-in-the-mlb-lead-to-shorter-games-and-more-stolen-bases/",
    "title": "New MLB rules lead to shorter games and more stolen bases",
    "topic": "Sports",
    "tags": [
      "MLB",
      "Pitch Clock",
      "Rafael Devers",
      "Baltimore Orioles"
    ],
    "summary": "New MLB rules, including a pitch clock, larger bases, and shift restrictions, have shortened games by an average of 20 minutes and led to more stolen bases in the 2023 season. The pitch clock, which penalizes pitchers and batters for delays, has been effective in reducing game length, bringing it down to an average of two hours and thirty-eight minutes."
  },
  {
    "link": "https://cnsmaryland.org/2023/04/13/maryland-womens-basketball-regular-season-attendance-skyrockets-but-inequality-still-prevalent/",
    "title": "Maryland Women’s Basketball regular season attendance skyrockets but inequality still prevalent",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Women",
      "Basketball",
      "Inequality",
      "Attendance"
    ],
    "summary": "Maryland's women’s basketball team saw its highest average regular season attendance in over a decade this year, yet it still lags behind the men’s team, which attracted nearly double the audience. Despite improvements, the disparity highlights ongoing inequalities in collegiate sports viewership and support."
  },
  {
    "link": "https://cnsmaryland.org/2023/03/03/alex-aust-holman-becomes-volunteer-assistant-coach-for-maryland-womens-lacrosse/",
    "title": "Alex Aust Holman becomes volunteer assistant coach for Maryland women’s lacrosse",
    "topic": "Sports",
    "tags": [
      "Alex Holman",
      "Maryland Lacrosse",
      "Volunteer Coach",
      "Championship Winner",
      "College Park"
    ],
    "summary": "Alex Aust Holman, a former player who won a championship with Maryland in 2010, returns to the team as a volunteer assistant coach after a decade."
  },
  {
    "link": "https://cnsmaryland.org/2023/02/27/at-one-school-a-sports-betting-company-aims-its-pitch-at-students/",
    "title": "At University of Colorado, a betting playbook aims its pitch at students",
    "topic": "Sports",
    "tags": [
      "PointsBet",
      "CU Boulder",
      "Richard Karcher",
      "Colorado"
    ],
    "summary": "PointsBet, a sports betting company, has partnered with the University of Colorado Boulder to market its brand, including at events where students under the legal gambling age are present. Despite claims that the target audience is alumni, critics argue that this partnership exposes young students to gambling advertising."
  },
  {
    "link": "https://cnsmaryland.org/2023/02/27/buzzy-sports-betting-posts-appeal-to-gen-z-social-media-audience/",
    "title": "Buzzy sports betting posts appeal to Gen Z social media audience",
    "topic": "Sports",
    "tags": [
      "PointsBet",
      "GenZ",
      "Instagram",
      "TikTok",
      "Universities"
    ],
    "summary": "PointsBet uses youthful, meme-based content on Instagram and TikTok to engage with Gen Z audiences, mirroring strategies of competitors like FanDuel and DraftKings. The company also partners with colleges and universities to reach alumni and fans, while leveraging social media platforms popular among younger users."
  },
  {
    "link": "https://cnsmaryland.org/2023/02/27/sports-betting-at-the-university-of-colorado/",
    "title": "On game day, sports betting is the new normal for some Colorado fans",
    "topic": "Sports",
    "tags": [
      "Colorado",
      "Betting",
      "Fans",
      "Game",
      "Day"
    ],
    "summary": "Sports betting has become a common activity among Colorado fans on game days, reflecting a shift in how spectators engage with sports. This trend highlights the growing acceptance and integration of betting into mainstream fan culture."
  },
  {
    "link": "https://cnsmaryland.org/2023/02/21/super-bowl-57-averages-over-113-million-viewers/",
    "title": "Super Bowl 57 averages over 113 million viewers",
    "topic": "Sports",
    "tags": [
      "Chiefs",
      "Eagles",
      "Harrison Butker",
      "James Bradberry",
      "Super Bowl"
    ],
    "summary": "Super Bowl 57 drew over 113 million average viewers as the Kansas City Chiefs defeated the Philadelphia Eagles in a thrilling game, marking the second most-watched Super Bowl in history and breaking a trend of declining viewership. The high viewership was attributed to engaging elements such as strong quarterback play, a close and high-scoring game, and an exciting finish."
  },
  {
    "link": "https://cnsmaryland.org/2023/02/13/super-bowl-lvii-kadarius-toney-makes-history-in-chiefs-win-over-eagles/",
    "title": "Super Bowl LVII: Kadarius Toney makes history in Chiefs’ win over Eagles",
    "topic": "Sports",
    "tags": [
      "Kadarius Toney",
      "Kansas City",
      "Philadelphia Eagles",
      "Dave Toub",
      "Patrick Mahomes"
    ],
    "summary": "Kadarius Toney made history in Super Bowl LVII by recording the longest punt return in Super Bowl history, a 65-yard run that significantly contributed to the Kansas City Chiefs' 38-35 victory over the Philadelphia Eagles. Despite limited playing time earlier in the game, Toney also caught a 5-yard touchdown pass from Patrick Mahomes, showcasing his impact on both offense and special teams."
  },
  {
    "link": "https://cnsmaryland.org/2022/12/07/choose-your-own-adventure-how-players-navigate-the-elite-basketball-landscape/",
    "title": "Choose your own adventure: How players navigate the elite basketball landscape",
    "topic": "Sports",
    "tags": [
      "Rodney Rice",
      "DeMatha Catholic",
      "Overtime Elite",
      "Hyattsville Maryland",
      "NBA Aspiration"
    ],
    "summary": "Rodney Rice, a star basketball player at DeMatha Catholic High School, was offered $600,000 by Overtime Elite to join their development program but ultimately chose to pursue college basketball. This decision comes as new media companies like Overtime and the National Interscholastic Basketball Conference are reshaping the landscape of elite high school sports."
  },
  {
    "link": "https://cnsmaryland.org/2022/12/07/two-cutting-edge-leagues-are-transforming-high-school-basketball/",
    "title": "Two cutting-edge leagues are transforming high school basketball",
    "topic": "Sports",
    "tags": [
      "Overtime",
      "ESPN",
      "Bronny James",
      "Mikey Williams",
      "NIBC"
    ],
    "summary": "Overtime and ESPN are pioneering new leagues that professionalize and elevate the profiles of top high school basketball players, aiming to develop them into future NBA stars while building profitable youth sports brands. These platforms have significantly boosted the social media presence of teen athletes, with some surpassing even current NBA MVP finalists in follower counts."
  },
  {
    "link": "https://cnsmaryland.org/2022/12/07/too-much-too-soon-elite-high-school-sports-put-young-athletes-in-a-pressure-cooker/",
    "title": "Too much, too soon? Elite high school sports put young athletes in a pressure cooker",
    "topic": "Sports",
    "tags": [
      "Greyson Chappel",
      "William Patterson",
      "Bishop Walsh",
      "National Interscholastic",
      "Missouri Camp"
    ],
    "summary": "Elite high school sports, often nationally televised, place young athletes under intense pressure, leading to anxiety and mental health issues. Greyson Chappel, a high school baseball player, faced performance anxiety and considered quitting but worked to overcome it while maintaining his resilience."
  },
  {
    "link": "https://cnsmaryland.org/2022/12/01/slider-temp/",
    "title": "Universities and their Sports Betting Deals – SLIDER",
    "topic": "Sports",
    "tags": [
      "Universities",
      "Betting",
      "Partnerships",
      "Ethical",
      "Concerns"
    ],
    "summary": "Universities are entering into partnerships with sports betting companies, raising ethical concerns about student exploitation and gambling addiction. These deals often include significant financial benefits for the institutions but have sparked debates on the impact on campus culture and student well-being."
  },
  {
    "link": "https://cnsmaryland.org/2022/08/08/most-approve-of-legalized-sports-wagering-but-concerns-over-college-games-remain/",
    "title": "Most approve of legalized sports wagering, but concerns over college games remain",
    "topic": "Sports",
    "tags": [
      "Tom McMillen",
      "College Scandals",
      "Legalized Gambling",
      "University Maryland"
    ],
    "summary": "While most sports fans approve of legalized betting on professional sports, there is significant concern and less support for betting on college sports due to fears of exploitation and historical scandals involving point-shaving and game-fixing among college athletes."
  },
  {
    "link": "https://cnsmaryland.org/2022/06/23/povich-poll-transgender-women/",
    "title": "Fairness, mental health are concerns in debate over transgender women in competitive sports",
    "topic": "Sports",
    "tags": [
      "Transgender",
      "Opposition",
      "Polling",
      "Advocacy",
      "FINA"
    ],
    "summary": "A recent poll shows majority opposition to transgender women competing against cisgender women in sports, influenced by media portrayal and societal attitudes. However, the survey also indicates growing social acceptance of transgender individuals, with 40% viewing it positively for society."
  },
  {
    "link": "https://cnsmaryland.org/2022/05/17/basketballs-mo-creek-was-ensnared-in-ukraine-war-then-helped-by-a-man-he-barely-knew/",
    "title": "Basketball’s Mo Creek was ensnared in Ukraine war, then helped by a man he barely knew",
    "topic": "Sports",
    "tags": [
      "Mo Creek",
      "Mykolaiv",
      "Ukraine War",
      "Russia Invasion",
      "Oxon Hill"
    ],
    "summary": "Mo Creek, a professional basketball player from Maryland, found himself trapped in Mykolaiv, Ukraine, when Russia invaded on February 24, 2022, turning his life upside down. Despite initial reassurances from his team that everything would be okay, the reality of war forced him to seek a way back home with help from a stranger."
  },
  {
    "link": "https://cnsmaryland.org/2022/04/19/months-after-the-launch-of-retail-sports-betting-in-maryland-mobile-options-have-yet-to-get-off-the-ground/",
    "title": "Months after the launch of retail sports betting in Maryland, mobile options have yet to get off the ground",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Hogan",
      "SWARC",
      "Casinos",
      "Tax"
    ],
    "summary": "Maryland's retail sports betting launched in December 2021, but mobile options have yet to be implemented due to delays by the Sports Wagering Application Review Commission (SWARC). This delay has caused Maryland to miss out on significant revenue and tax opportunities from major sporting events like the Super Bowl and March Madness."
  },
  {
    "link": "https://cnsmaryland.org/2022/03/31/the-washington-spirit-makes-a-second-half-comeback-against-the-north-carolina-courage/",
    "title": "The Washington Spirit makes a second half comeback against the North Carolina Courage",
    "topic": "Sports",
    "tags": [
      "Washington Spirit",
      "North Carolina",
      "Comeback",
      "Draw"
    ],
    "summary": "The Washington Spirit struggled against the North Carolina Courage's defense in the first half but staged a strong comeback in the second half. They scored two crucial goals, securing a draw in the match."
  },
  {
    "link": "https://cnsmaryland.org/2022/03/15/with-wentz-in-the-wings-commanders-hope-for-turnaround-again/",
    "title": "With Wentz in the wings, Commanders hope for turnaround. Again.",
    "topic": "Sports",
    "tags": [
      "Carson Wentz",
      "Washington Commanders",
      "NFC East",
      "FedEx Field"
    ],
    "summary": "The Washington Commanders traded three high-round draft picks to acquire quarterback Carson Wentz from the Indianapolis Colts, aiming to bring stability to the position and revitalize a team that hasn't won a Super Bowl since 1992. Despite giving up significant draft capital, the move reflects the Commanders' urgency to improve after a tumultuous period marked by a name change and controversy surrounding their owner."
  },
  {
    "link": "https://cnsmaryland.org/2022/03/08/maryland-womens-gymnastics-dominates-in-the-xfinity-center-on-sunday/",
    "title": "Maryland women’s gymnastics dominates in the Xfinity Center on Sunday",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Xfinity Center",
      "Audrey Barber",
      "Yale"
    ],
    "summary": "The University of Maryland women’s gymnastics team triumphed over William & Mary, Yale, and N.C. State on Sunday at the Xfinity Center."
  },
  {
    "link": "https://cnsmaryland.org/2022/03/03/maryland-basketball-defeats-minnesota-in-a-celebration-of-the-senior-players/",
    "title": "Maryland basketball celebrates seniors in Minnesota win",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Minnesota",
      "Simon Wright",
      "Eric Ayala",
      "Xfinity Center"
    ],
    "summary": "Maryland's basketball team secured their fourth consecutive win by defeating Minnesota 84-73, celebrating seniors Simon Wright, Eric Ayala, Xavier Green, and Fatts Russell. The victory marks a significant step in the team’s recovery from earlier season setbacks."
  },
  {
    "link": "https://cnsmaryland.org/2022/02/25/university-of-maryland-tennis-defeats-brown-university/",
    "title": "University of Maryland tennis defeats Brown University",
    "topic": "Sports",
    "tags": [
      "University Maryland",
      "Brown University",
      "Winning Streak",
      "College Park",
      "2019-2020 Season"
    ],
    "summary": "The University of Maryland women's tennis team extended their winning streak by defeating Brown University, achieving a level of success not seen since the 2019-2020 season."
  },
  {
    "link": "https://cnsmaryland.org/2022/02/14/los-angeles-rams-win-super-bowl-lvi-cincinnati-bengals/",
    "title": "Los Angeles Rams script storybook ending in Super Bowl win",
    "topic": "Sports",
    "tags": [
      "Eric Weddle",
      "Los Angeles",
      "Aaron Donald",
      "Von Miller",
      "SoFi Stadium"
    ],
    "summary": "Eric Weddle, who came out of retirement to join the Los Angeles Rams, celebrated a fairy-tale ending as the team's 37-year-old safety after they won Super Bowl LVI against the Cincinnati Bengals. The Rams' defense, led by Aaron Donald and Von Miller with crucial sacks on Joe Burrow, secured a 23-20 victory in a high-intensity finale."
  },
  {
    "link": "https://cnsmaryland.org/2021/12/16/diversity-among-big-ten-head-coaches/",
    "title": "Diversity among Big Ten head coaches",
    "topic": "Sports",
    "tags": [
      "Mike Locksley",
      "Marisa Moseley",
      "Kevin Warren",
      "Big Ten",
      "Diversity"
    ],
    "summary": "Power 5 conferences, including the Big Ten, are making progress in increasing diversity among head coaches. Mike Locksley, Marisa Moseley, and Commissioner Kevin Warren discuss their experiences and the conference's efforts in promoting diversity."
  },
  {
    "link": "https://cnsmaryland.org/2021/06/02/baseball-fans-reflect-on-national-anthem-following-povich-center-cdce-post-poll/",
    "title": "Baseball fans reflect on national anthem following Povich Center-CDCE-Post poll",
    "topic": "Sports",
    "tags": [
      "Frederick Keys",
      "Nymeo Field",
      "Amy Lester",
      "Shirley Povich",
      "University Maryland"
    ],
    "summary": "Despite a rainstorm cancelling the Frederick Keys’ home-opener, the national anthem was performed, evoking positive sentiments from fans like Amy Lester and broadcaster JJ Michalski. A recent poll by the Shirley Povich Center and The Washington Post found that 84% of Americans support playing the national anthem before professional sporting events, though feelings among Black Americans are more mixed, with 23% finding it hurtful or unrepresentative."
  },
  {
    "link": "https://cnsmaryland.org/2021/05/06/the-numbers-behind-the-us-mens-national-soccer-team-in-europes-top-five-leagues/",
    "title": "The numbers behind the US men’s national soccer team in Europe’s top five leagues",
    "topic": "Sports",
    "tags": [
      "USMNT",
      "Europe",
      "Pulisic",
      "Reyna",
      "Premier-League"
    ],
    "summary": "The US men’s national soccer team has seen a significant boost with 20 players now competing in Europe's top five leagues, collectively valued at $261.25 million, highlighting their growing presence on the international stage. Christian Pulisic and Giovanni Reyna, valued at $55.0 million and $41.8 million respectively, are pivotal to the team’s future success."
  },
  {
    "link": "https://cnsmaryland.org/2021/05/04/washington-capitals-fans-return-for-the-first-time-in-over-a-year/",
    "title": "Washington Capitals fans return for the first time in over a year",
    "topic": "Sports",
    "tags": [
      "Washington Capitals",
      "Capital One",
      "Season Ticket",
      "DC Fans",
      "Limited Attendance"
    ],
    "summary": "Washington Capitals fans returned to Capital One Arena for the first time in over a year, with attendance capped at 10% capacity. Season ticket holders were given priority access to the limited tickets."
  },
  {
    "link": "https://cnsmaryland.org/2021/04/23/maryland-is-at-the-forefront-of-youth-cricket-in-the-u-s/",
    "title": "Maryland is at the forefront of youth cricket in the U.S.",
    "topic": "Sports",
    "tags": [
      "Sham Chotoo",
      "Maryland Youth",
      "Cricket Association",
      "Prince George’s",
      "Montgomery Counties"
    ],
    "summary": "Sham Chotoo initiated and grew a youth cricket program in Maryland from 50 sign-ups in 2012 to over 1,000 students by 2013, leading to the establishment of the Maryland Youth Cricket Association. By simplifying the game and appealing to American parents seeking alternatives, Chotoo created the first elementary school cricket league in the U.S., expanding the sport's reach and popularity among young players."
  },
  {
    "link": "https://cnsmaryland.org/2021/04/16/the-return-of-the-march-madness-has-buoyed-chicken-wing-sales/",
    "title": "The return of the March Madness has buoyed chicken wing sales",
    "topic": "Sports",
    "tags": [
      "NCAA Tournament",
      "Chicken Wings",
      "Frisco's Taphouse",
      "Crofton MD",
      "Record Sales"
    ],
    "summary": "The return of the NCAA Men's Basketball tournament has significantly boosted chicken wing sales, helping restaurants recover from the 2020 surplus that led to plummeting prices. Frisco’s Taphouse in Crofton is among those benefiting, with sales reaching record highs."
  },
  {
    "link": "https://cnsmaryland.org/2021/04/16/student-athletes-and-coaches-reflect-on-how-great-it-feels-to-have-fans-back-in-the-stands/",
    "title": "Student athletes and coaches reflect on how great it feels to have fans back in the stands",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Fans",
      "College Park",
      "Terp",
      "Atmosphere"
    ],
    "summary": "Maryland student athletes and coaches express joy at having fans return to their games after over a year, noting the significant improvement in atmosphere. The presence of supporters is described as essential for creating a normal and energized environment."
  },
  {
    "link": "https://cnsmaryland.org/2021/04/06/some-fans-wary-of-return-to-live-baseball-povich-poll-finds/",
    "title": "Some fans wary of return to live baseball, Povich Center-CDCE-Post poll finds",
    "topic": "Sports",
    "tags": [
      "Povich Center",
      "Camden Yards",
      "George Hudnet",
      "Baltimore Orioles",
      "Greg Bader"
    ],
    "summary": "A recent poll by the Shirley Povich Center for Sports Journalism and partners found that 66% of U.S. adults feel comfortable attending outdoor sporting events like baseball, while only 32% are comfortable with indoor events like basketball."
  },
  {
    "link": "https://cnsmaryland.org/2021/04/06/motorsports-in-maryland-set-for-a-restart-after-tough-2020/",
    "title": "Motorsports in Maryland set for a restart after tough 2020",
    "topic": "Sports",
    "tags": [
      "Hagerstown Speedway",
      "Lisa Plessinger",
      "Pandemic impact",
      "Restart racing"
    ],
    "summary": "Maryland's motorsports facilities, including Hagerstown Speedway, faced significant setbacks in 2020 due to the COVID-19 pandemic, leading to cancellations of major events and a prolonged shutdown. As restrictions ease, motorsports are set to restart, bringing back the vibrant atmosphere of racing with engines roaring and fans cheering."
  },
  {
    "link": "https://cnsmaryland.org/2021/04/06/nancy-heil-racehorse-karans-notion/",
    "title": "‘He saved my life’: The story of Nancy Heil and racehorse Karan’s Notion",
    "topic": "Sports",
    "tags": [
      "Nancy Heil",
      "Karan’s Notion",
      "Maryland Million",
      "Farm Saved",
      "78-year-old Breeder"
    ],
    "summary": "Nancy Heil, a 78-year-old breeder and trainer, saw her homebred horse Karan’s Notion win the Maryland Million Sprint in 2020, securing a $102,000 purse. The victory saved her farm, marking her first eligibility for the prestigious race after over 50 years in the industry."
  },
  {
    "link": "https://cnsmaryland.org/2021/04/01/the-maryland-gymnastics-team-bounces-back-and-secures-a-spot-in-ncaa-regionals/",
    "title": "The Maryland gymnastics team bounces back and secures a spot in NCAA regionals",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "GymTerps",
      "NCAA",
      "College Park",
      "Covid-19"
    ],
    "summary": "The Maryland gymnastics team, after facing a halt to their 2020 season due to Covid-19, has successfully rebuilt and earned a bid to the NCAA regionals. This comeback marks a significant achievement for the GymTerps, who were anticipated to have a record-breaking postseason run before the pandemic."
  },
  {
    "link": "https://cnsmaryland.org/2021/03/09/maryland-athletics-launches-momentum/",
    "title": "Maryland Athletics launches Momentum",
    "topic": "Sports",
    "tags": [
      "University Maryland",
      "Opendorse Partnership",
      "Student-Athlete Brands",
      "College Adaptation",
      "Advocacy Platforms"
    ],
    "summary": "The University of Maryland has partnered with Opendorse to launch Momentum, a program designed to help student-athletes build and manage their personal brands. This initiative comes as more professional athletes use their platforms to advocate for various causes."
  },
  {
    "link": "https://cnsmaryland.org/2021/02/23/pushed-too-far-overexertion-has-claimed-lives-of-22-division-i-football-players-since-2000/",
    "title": "Pushed too far: Overexertion has claimed lives of 22 Division I football players since 2000",
    "topic": "Sports",
    "tags": [
      "Overexertion",
      "Training",
      "Fatalities",
      "Division",
      "Players"
    ],
    "summary": "Since 2000, overexertion during training has led to the deaths of 22 Division I football players. The intense physical demands and pressure to perform are being scrutinized for contributing to these fatalities."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/30/howard-is-the-hbcu-making-headlines-during-college-basketballs-offseason/",
    "title": "Howard is the HBCU making headlines during College basketball’s offseason",
    "topic": "Sports",
    "tags": [
      "Howard",
      "Maker",
      "Eastern",
      "Bison",
      "Purdue"
    ],
    "summary": "Howard University's basketball team made national headlines by securing commitments from five-star recruit Makur Maker and transfer Nojel Eastern, boosting the program's profile significantly during the offseason."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/30/travis-pastrana-is-going-to-jump-ego-alley-in-his-newest-stunt/",
    "title": "Travis Pastrana is going to jump Ego Alley in his newest stunt",
    "topic": "Sports",
    "tags": [
      "Travis Pastrana",
      "Ego Alley",
      "Annapolis",
      "Stunt"
    ],
    "summary": "Travis Pastrana plans to jump over Ego Alley in Annapolis as part of a new movie. The American motorsports star and stunt performer is preparing for this daring feat."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/18/maryland-football-countdown-continues/",
    "title": "Maryland football countdown continues",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Coach Locksley",
      "Season Opener",
      "Terps",
      "September 24th"
    ],
    "summary": "Maryland's football season begins in nine days, with the team preparing for their season opener on September 24th. Players and Coach Locksley share their excitement as the countdown continues."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/18/former-maryland-football-players-transition-to-becoming-a-coach/",
    "title": "Former Maryland football player’s transition to becoming a Coach",
    "topic": "Sports",
    "tags": [
      "Cam Spence",
      "Maryland Football",
      "NFL Players",
      "Coaching Career",
      "Pandemic Opportunity"
    ],
    "summary": "Cam Spence, a former Maryland football player whose career was cut short by injuries, transitioned into coaching and spent the summer training NFL players. Despite retiring in 2019, Spence made significant strides in establishing himself within the coaching realm during the pandemic."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/14/pumped-for-pickleball/",
    "title": "Pumped for Pickleball",
    "topic": "Sports",
    "tags": [
      "Montgomery County",
      "Pickleball Courts",
      "Stay Active",
      "Socially Distanced",
      "Meet People"
    ],
    "summary": "Pickleball has gained popularity in Montgomery County, offering residents a fun and socially distanced way to stay active. Courts are widely available throughout the county, making it easy for enthusiasts to enjoy the sport and connect with others."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/09/update-on-the-terps-football-team/",
    "title": "Update on the Terps football team",
    "topic": "Sports",
    "tags": [
      "Terps",
      "Maryland",
      "College Park",
      "Season Preparation"
    ],
    "summary": "The Terps football team is making final preparations for the upcoming season, which begins in two weeks. They aim to improve their gameplay for a successful campaign."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/07/big-ten-football-is-back/",
    "title": "Big Ten Football is back",
    "topic": "Sports",
    "tags": [
      "Big Ten",
      "Maryland",
      "Northwestern",
      "Conference Decision",
      "Reversal"
    ],
    "summary": "The Big Ten Conference, which initially postponed its football season in August, has reversed its decision and will now play an 8-game regular season plus a championship week. Maryland's first game is scheduled for October 24th against Northwestern."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/07/dozens-rally-in-anne-arundel-county-for-the-return-of-high-school-sports/",
    "title": "Dozens rally in Anne Arundel County for the return of high school sports",
    "topic": "Sports",
    "tags": [
      "Anne Arundel",
      "Severna Park",
      "Robert Ehrlich",
      "Earleigh Heights"
    ],
    "summary": "Dozens of parents and players rallied in Severna Park, Maryland, advocating for the return of high school sports, with former Governor Robert Ehrlich among the organizers. The event took place at the Earleigh Heights Volunteer Fire Department Co."
  },
  {
    "link": "https://cnsmaryland.org/2020/10/01/how-will-no-fans-affect-football-games/",
    "title": "How will no fans affect football games",
    "topic": "Sports",
    "tags": [
      "Big Ten",
      "No Fans",
      "Player Impact",
      "College Park"
    ],
    "summary": "The Big Ten Conference has decided to play football games without spectators this year. This move aims to mitigate health risks but could affect player performance and atmosphere."
  },
  {
    "link": "https://cnsmaryland.org/2020/05/06/premier-lacrosse-league-announces-plan-for-quarantined-tournament/",
    "title": "Premier Lacrosse League announces plan for quarantined tournament",
    "topic": "Sports",
    "tags": [
      "PLL",
      "Championship",
      "Series",
      "PaulRabil",
      "Quarantined"
    ],
    "summary": "The Premier Lacrosse League will host a quarantined tournament from July 25 to August 9, featuring a robust medical protocol including a \"three tier testing policy\" to ensure player and staff safety during the COVID-19 pandemic. This makes the PLL the first North American team-sports league to announce plans for restarting play amidst the health crisis."
  },
  {
    "link": "https://cnsmaryland.org/2020/04/24/whats-next-for-college-athletic-directors-under-pandemic/",
    "title": "What’s next for college athletic directors under pandemic?",
    "topic": "Sports",
    "tags": [
      "NCAA",
      "COVID-19",
      "Maryland",
      "Damon Evans",
      "Coppin State"
    ],
    "summary": "Collegiate athletic directors nationwide, including those in Maryland, are navigating unprecedented challenges following the NCAA's cancellation of winter and spring sports seasons due to COVID-19, with no clear timeline for return. They are preparing multiple plans while adjusting to a new normal without sports, facing significant personal and professional disruptions."
  },
  {
    "link": "https://cnsmaryland.org/2020/04/23/collegiate-coaches-moving-forward-through-coronavirus-concerns/",
    "title": "Collegiate coaches moving forward through coronavirus concerns",
    "topic": "Sports",
    "tags": [
      "NCAA",
      "COVID-19",
      "Towson",
      "Richardson",
      "Amplo"
    ],
    "summary": "College coaches faced the challenging task of informing their athletes about the cancellation of seasons due to the COVID-19 pandemic, dealing with emotional reactions and uncertain futures. The cancellations affected eligibility and scholarships, forcing coaches to navigate new uncertainties in collegiate sports."
  },
  {
    "link": "https://cnsmaryland.org/2020/04/22/cancellation-of-spring-sports-a-tough-call-for-student-athletes/",
    "title": "Cancellation of spring sports a tough call for student-athletes",
    "topic": "Sports",
    "tags": [
      "COVID-19",
      "Loyola",
      "Navy",
      "Peter Swindell",
      "Bucknell"
    ],
    "summary": "The cancellation of winter and spring sports seasons due to the COVID-19 pandemic left college student-athletes, particularly seniors, feeling shocked and saddened as their seasons and opportunities for postseason play were abruptly ended. Despite the challenges, athletes like Loyola University Maryland’s Peter Swindell and St."
  },
  {
    "link": "https://cnsmaryland.org/2020/04/22/maryland-high-school-athletes-lose-vital-time-during-pandemic/",
    "title": "Maryland high school athletes lose vital time during pandemic",
    "topic": "Sports",
    "tags": [
      "Jade Greene",
      "Bishop McNamara",
      "NCAA Rules",
      "College Recruiters",
      "Financial Constraints"
    ],
    "summary": "Jade Greene, a high school junior and shortstop, lost crucial exposure to college recruiters due to the pandemic suspension of her softball season. The NCAA's recruiting rules and financial constraints may further complicate her and other athletes' opportunities to secure scholarships."
  },
  {
    "link": "https://cnsmaryland.org/2020/03/10/northeastern-holds-off-late-elon-rally-advances-to-caa-final-with-68-60-win/",
    "title": "Northeastern holds off late Elon rally, advances to CAA final with 68-60 win",
    "topic": "Sports",
    "tags": [
      "Jordan Roland",
      "Northeastern Huskies",
      "Elon University",
      "Bill Coen",
      "CAA Championship"
    ],
    "summary": "Northeastern's Jordan Roland scored 10 of his team's final 12 points, including crucial back-to-back threes, to secure a 68-60 win over Elon and advance to their third consecutive CAA championship game. Despite an early 35-15 lead, Northeastern faced a late rally from Elon but ultimately held on for the victory."
  },
  {
    "link": "https://cnsmaryland.org/2020/03/09/hofstra-basketball-caa-final-delaware/",
    "title": "Hofstra advances to CAA basketball final with 75-61 win over Delaware",
    "topic": "Sports",
    "tags": [
      "Hofstra",
      "Pemberton",
      "Delaware",
      "Trueheart",
      "Kante"
    ],
    "summary": "Hofstra secured their spot in the CAA basketball final with a 75-61 victory over Delaware, thanks to Eli Pemberton's 24 points and the team's effective defensive strategy. The game was largely decided by halftime, with Hofstra leading 40-28 and maintaining control throughout."
  },
  {
    "link": "https://cnsmaryland.org/2020/02/10/d-c-s-new-xfl-team-gets-rave-reviews-after-first-game/",
    "title": "D.C.’s new XFL team gets rave reviews after first game",
    "topic": "Sports",
    "tags": [
      "D.C. Defenders",
      "Audi Field",
      "Max Alpert",
      "Seattle Dragons",
      "Mike Clay"
    ],
    "summary": "The D.C. Defenders' inaugural XFL game drew over 17,000 enthusiastic fans and resulted in a 31-19 win against the Seattle Dragons, invigorating D.C.-area football fans tired of their NFL team's poor performance."
  },
  {
    "link": "https://cnsmaryland.org/2020/02/03/magic-mahomes-leads-chiefs-to-second-super-bowl-in-franchise-history/",
    "title": "‘Magic Mahomes’ leads Kansas City Chiefs to first Super Bowl win in 50 years",
    "topic": "Sports",
    "tags": [
      "Patrick Mahomes",
      "Kansas City",
      "Super Bowl",
      "Hard Rock",
      "Youngest MVP"
    ],
    "summary": "Patrick Mahomes led the Kansas City Chiefs to a 31-20 comeback victory over the San Francisco 49ers in Super Bowl LIV, becoming the youngest quarterback to win both a Super Bowl and league MVP. With two touchdown passes in the final six minutes, he secured the Chiefs' second title in franchise history after a 50-year drought."
  },
  {
    "link": "https://cnsmaryland.org/2020/02/02/super-bowl-liv-preview-san-francisco-49ers-vs-kansas-city-chiefs/",
    "title": "Super Bowl LIV preview: San Francisco 49ers vs. Kansas City Chiefs",
    "topic": "Sports",
    "tags": [
      "Patrick Mahomes",
      "San Francisco",
      "Kansas City",
      "Hard Rock",
      "Travis Kelce"
    ],
    "summary": "The San Francisco 49ers and Kansas City Chiefs will face off in Super Bowl LIV at Hard Rock Stadium in Miami, featuring a clash between the 49ers' top-ranked defense and the Chiefs' high-powered offense led by MVP quarterback Patrick Mahomes. Both teams boast elite tight ends, with Travis Kelce for the Chiefs and George Kittle for the 49ers, adding an exciting dimension to the game."
  },
  {
    "link": "https://cnsmaryland.org/2020/02/01/kansas-city-qb-patrick-mahomes-surprises-defenses-with-never-ending-bag-of-tricks/",
    "title": "Kansas City QB Patrick Mahomes surprises defenses with never-ending bag of tricks",
    "topic": "Sports",
    "tags": [
      "Patrick Mahomes",
      "Chiefs",
      "Miami",
      "Super Bowl",
      "Travis Kelce"
    ],
    "summary": "Kansas City Chiefs quarterback Patrick Mahomes is known for his unpredictable and spectacular plays on the field, which often leave both teammates and opponents in awe. His unique throwing techniques and instinctive playmaking, influenced by his background in baseball, have been instrumental in leading the Chiefs to Super Bowl LIV."
  },
  {
    "link": "https://cnsmaryland.org/2020/02/01/san-franciscos-raheem-mostert-rides-wave-of-momentum-into-super-bowl-liv/",
    "title": "San Francisco’s Raheem Mostert rides wave of momentum into Super Bowl LIV",
    "topic": "Sports",
    "tags": [
      "Raheem Mostert",
      "49ers",
      "New Smyrna",
      "Surfing",
      "Resilience"
    ],
    "summary": "Raheem Mostert's 220-yard, four-touchdown performance in the NFC Championship game secured the 49ers' spot in Super Bowl LIV, and his unique surfing celebration reflects his passion for the sport that helped him cope with personal challenges and professional setbacks. After being cut by multiple teams, Mostert found success with the 49ers and introduced teammates to surfing, showcasing his resilience both on and off the field."
  },
  {
    "link": "https://cnsmaryland.org/2020/01/30/former-good-counsel-teammates-live-out-super-bowl-dream-with-kansas-city/",
    "title": "Former Good Counsel teammates live out Super Bowl dream with Kansas City",
    "topic": "Sports",
    "tags": [
      "Kendall Fuller",
      "Dorian O'Daniel",
      "Kansas City",
      "Good Counsel",
      "Super Bowl"
    ],
    "summary": "Kendall Fuller and Dorian O’Daniel, former teammates from Our Lady of Good Counsel High School, are now set to play together in Super Bowl LIV with the Kansas City Chiefs against the San Francisco 49ers. Their journey from high school rivals to NFL teammates has been a dream come true, filled with unexpected twists and shared moments of disbelief and joy."
  },
  {
    "link": "https://cnsmaryland.org/2019/12/18/more-domed-stadiums-fewer-ski-resorts-expect-climate-change-to-affect-sports-around-the-world/",
    "title": "More domed stadiums, fewer ski resorts: Expect climate change to affect sports around the world",
    "topic": "Sports",
    "tags": [
      "Houston",
      "Baseball",
      "Climate",
      "Economy",
      "Domes"
    ],
    "summary": "As global temperatures rise, many sports leagues, particularly baseball, are adapting to climate change by shifting schedules and considering new air-conditioned stadiums, while facing economic impacts such as increased postponements and costs. Skiing and other outdoor sports are also expected to be significantly affected, with entire communities relying on these sports facing an uncertain future."
  },
  {
    "link": "https://cnsmaryland.org/2019/12/18/washington-bullpen-podcast-i-had-to-stand-up-politics-and-sports-in-the-nations-capital/",
    "title": "Washington Bullpen podcast: “I had to stand up” – Politics and sports in the nation’s capital",
    "topic": "Sports",
    "tags": [
      "Ray Schoenke",
      "President Nixon",
      "Vietnam War",
      "Washington Team",
      "Polynesian Hall"
    ],
    "summary": "Ray Schoenke, a former NFL player for Washington, risked his career by refusing to take a picture with President Nixon during a 1971 practice to protest the Vietnam War. After retiring, Schoenke was recognized as one of Washington’s top 100 players and inducted into the Polynesian Football Hall of Fame, reflecting on the evolving relationship between politics and sports."
  },
  {
    "link": "https://cnsmaryland.org/2019/11/07/ncaa-rules-help-umd-others-inflate-football-attendance-figures/",
    "title": "NCAA rules help UMD, others inflate football attendance figures",
    "topic": "Sports",
    "tags": [
      "NCAA",
      "Maryland",
      "Big Ten",
      "Attendance",
      "Inflation"
    ],
    "summary": "NCAA rules allow colleges to report either actual or distributed ticket numbers as attendance, leading to inflated figures; Maryland, for example, reported a 56.3% difference between announced and scanned attendance in 2018. This discrepancy is common across the Big Ten, masking declining actual attendance at games."
  },
  {
    "link": "https://cnsmaryland.org/2019/10/31/maryland-womens-soccer-makes-big-ten-tournament-for-first-time-in-history/",
    "title": "Maryland women’s soccer makes Big Ten Tournament for first time in history",
    "topic": "Sports",
    "tags": [
      "Maryland",
      "Big Ten",
      "Women's Soccer",
      "First Time",
      "Historic Milestone"
    ],
    "summary": "Maryland's women’s soccer team has achieved a historic milestone by qualifying for the Big Ten tournament for the first time since joining the conference in 2014. This marks a significant breakthrough for the program."
  },
  {
    "link": "https://cnsmaryland.org/2019/10/31/by-the-numbers-washington-nationals-win-the-world-series/",
    "title": "By the numbers: Washington Nationals win the World Series",
    "topic": "Sports",
    "tags": [
      "Washington Nationals",
      "Houston Astros",
      "World Series",
      "Game 7",
      "Timely Hitting"
    ],
    "summary": "The Washington Nationals secured their first World Series title by winning Game 7 against the Houston Astros, 6-2, on the road. Their victory was marked by strong pitching and timely hitting throughout the series."
  },
  {
    "link": "https://cnsmaryland.org/2019/10/31/nationals-finishedthefight-now-its-time-for-the-parade/",
    "title": "Nationals #FinishedTheFight, now it’s time for the parade",
    "topic": "Sports",
    "tags": [
      "Washington Nationals",
      "Muriel Bowser",
      "Constitution Avenue",
      "Pennsylvania Avenue",
      "Stephen Strasberg"
    ],
    "summary": "The Washington Nationals, who won their first World Series title and the city's first since 1924, will celebrate with a parade on Saturday starting at 2 p.m. from Constitution Avenue and 15th Street, ending at Pennsylvania Avenue and 3rd Street where they will rally."
  },
  {
    "link": "https://cnsmaryland.org/2019/10/24/by-the-numbers-washington-nationals-in-the-world-series/",
    "title": "By the numbers: Washington Nationals in the World Series",
    "topic": "Sports",
    "tags": [
      "Washington D.C.",
      "Nationals",
      "Astros",
      "World Series",
      "Underdogs"
    ],
    "summary": "The Washington Nationals, up 2-0 against the Houston Astros, are on the brink of winning their first World Series title with impressive offensive performance. Despite being underdogs, they have scored 17 runs in two games against Houston’s strong pitching."
  },
  {
    "link": "https://cnsmaryland.org/2019/10/24/79859/",
    "title": "The Washington Nationals stimulate $6.5 million economic boon in World Series",
    "topic": "Sports",
    "tags": [
      "Washington",
      "Nationals",
      "Economy",
      "D.C.",
      "Fans"
    ],
    "summary": "The Washington Nationals' victory in Game 1 of the World Series is boosting D.C.'s economy by an estimated $6.5 million. Fans and local businesses are benefiting from the increased activity around Nationals Park."
  },
  {
    "link": "https://cnsmaryland.org/2019/10/01/a-look-into-major-league-baseballs-massive-home-run-surge-in-2019/",
    "title": "A look into Major League Baseball’s massive home run surge in 2019",
    "topic": "Sports",
    "tags": [
      "MLB",
      "Home Runs",
      "Baltimore Orioles",
      "Minnesota Twins",
      "J.D. Martinez"
    ],
    "summary": "In 2019, Major League Baseball shattered its single-season home run record with 6,776 homers, with many teams setting or tying their own franchise records. Theories about the surge include changes in pitching and hitting strategies, as well as speculation that the baseballs themselves had been altered."
  },
  {
    "link": "https://cnsmaryland.org/2019/04/17/caps-look-to-seize-momentum-in-game-4-after-fight/",
    "title": "Caps look to seize momentum in Game 4 after fight",
    "topic": "Sports",
    "tags": [
      "Alex Ovechkin",
      "Andrei Svechnikov",
      "Carolina Hurricanes",
      "Washington Capitals",
      "Concussion Protocol"
    ],
    "summary": "In Game 3 of their first-round NHL series, the Washington Capitals lost to the Carolina Hurricanes 5-0, but a physical altercation between Alex Ovechkin and Andrei Svechnikov, which resulted in Svechnikov's injury and concussion protocol, overshadowed the game. Despite the loss, the Capitals lead the series 2-1 and look to capitalize on their momentum in Game 4."
  },
  {
    "link": "https://cnsmaryland.org/2019/04/05/the-return-of-the-orioles-gives-baltimore-a-chance-to-celebrate/",
    "title": "The return of the Orioles gives Baltimore a chance to celebrate",
    "topic": "Sports",
    "tags": [
      "Baltimore",
      "Orioles",
      "Camden Yards",
      "Mayor Pugh",
      "CommunityCelebration"
    ],
    "summary": "Despite controversies surrounding Mayor Pugh, Baltimore residents turned out at Camden Yards to celebrate the Orioles' home opener. The return of the team provided a much-needed opportunity for community celebration and unity."
  },
  {
    "link": "https://cnsmaryland.org/2019/04/05/nats-rallying-after-turner-injury/",
    "title": "Nats rallying after Turner injury",
    "topic": "Sports",
    "tags": [
      "Trea Turner",
      "Washington Nationals",
      "Dave Martinez",
      "Bryce Harper",
      "Philadelphia Phillies"
    ],
    "summary": "Washington Nationals bounced back from shortstop Trea Turner's season-ending finger injury with a dramatic 9-8 walk-off win against the Phillies, followed by a shutout victory over the Mets. Despite the significant loss, the team showed resilience and acknowledged Turner’s importance to their lineup."
  },
  {
    "link": "https://cnsmaryland.org/2019/04/03/former-terp-ravens-football-player-continues-to-provide-support-to-baltimore-residents/",
    "title": "Former Terp, Ravens football player continues to provide support to Baltimore residents",
    "topic": "Sports",
    "tags": [
      "Torrey Smith",
      "Baltimore Residents",
      "Charity Event",
      "Fundraiser Kids",
      "Baltimore Schools"
    ],
    "summary": "Former Baltimore Raven Torrey Smith hosted his 8th annual charity basketball game this weekend, continuing his support for Baltimore residents. The event raised funds to assist children in Baltimore schools."
  },
  {
    "link": "https://cnsmaryland.org/2019/04/03/baseball-twitter-buzzes-about-orioles-surprising-start-harper-being-booed/",
    "title": "Baseball Twitter buzzes about Orioles’ surprising start, Harper being booed",
    "topic": "Sports",
    "tags": [
      "Baltimore Orioles",
      "Camden Yards",
      "Bryce Harper",
      "Nationals Park",
      "Philadelphia Phillies"
    ],
    "summary": "The Baltimore Orioles have started the 2019 season strong with a 4-1 record, including a series win over the New York Yankees, while Bryce Harper faced boos during his return to Nationals Park with the Philadelphia Phillies."
  }
]