[{"link": "https://cnsmaryland.org/2025/09/17/microsoft-to-open-a-new-quantum-center-at-university-of-maryland-research-hub/", "title": "Microsoft to open a new quantum center at University of Maryland research hub", "topic": "Economy", "tags": ["Microsoft", "Quantum", "University Maryland", "Wes Moore", "Discovery District"], "summary": "Microsoft is establishing a new quantum research center near the University of Maryland to foster collaboration on quantum technology with government and academic partners. This initiative, part of Governor Wes Moore’s Capital of Quantum plan, aims to position Maryland as a leader in quantum computing with over $70 million in investments.", "content": "ANNAPOLIS – Microsoft plans to open a new quantum research center just off the campus of the University of Maryland, giving academics and researchers direct access to the company’s latest hardware prototypes. \nThe new center will allow government agencies and academic institutions to collaborate on hardware and software development, Gov. Wes Moore announced on Wednesday. \n“Maryland is making big bets on the future to grow our economy and drive innovation,” Moore said in a press release announcing the development. “Quantum is at the center of that strategy.” \nMicrosoft will be joining several other companies in the University of Maryland’s Discovery District, a research park designed to help government officials, researchers and entrepreneurs work together on new technology ventures. \nThe University of Maryland and other partners in the initiative have pledged more than $70 million to help the state become a leader in quantum computing, which performs mathematical calculations exponentially faster than the old way. Moore launched the Capital of Quantum initiative in January with an initial investment of $52.5 million of the state’s FY2026 budget. \n“We are excited to be part of Governor Moore’s vision for the Capital of Quantum through the opening of this unique, partner-focused quantum center in Maryland’s Discovery District,” said Jason Zander, executive vice president at Microsoft. “This partnership exemplifies what is possible when state and federal leaders, academia, and industry unite for a common purpose.”"},
 {"link": "https://cnsmaryland.org/2025/07/07/maryland-grocery-tracker/", "title": "Maryland grocery tracker", "topic": "Economy", "tags": ["Maryland", "groceries", "tariffs", "bird flu", "Safeway"], "summary": "Maryland residents face rising grocery prices due to tariffs, climate changes, and a bird flu outbreak, affecting staples like eggs and coffee. Capital News Service has developed a tracker using data from major retailers across the state to monitor these price increases.", "content": "\n\n\n\n\nHas your grocery bill shot up?\nIf you’ve visited the aisles of any Maryland supermarket recently, you’ve likely noticed that prices have ticked higher on more than a few of your staple foods. A perfect storm of rising tariffs, changing climates, and a bird flu outbreak have driven up the price of everything from eggs to coffee, with no clear relief in sight.\nCapital News Service created a tracker to measure the prices of common items sold in Maryland grocery stores. The data is aggregated from online price listings.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSource: All data collected by Capital News Service and Local News Network from grocery stores across the state of Maryland. The prices indicated represent averages calculated based on data collected from online shopping sites of major grocery retailers including Safeway, Giant Food and Weis Market. Prices from several locations of each store are collected to represent geographic differences in grocery pricing. Data collection by Samuel Gauntt. Design by Olivia Borgula\n\n\n[/vc_column_text][/vc_column][/vc_row]"},
 {"link": "https://cnsmaryland.org/2025/05/16/marylands-largest-underground-coal-mine-changes-hands/", "title": "Maryland’s largest underground coal mine changes hands", "topic": "Economy", "tags": ["Rosebud Mining", "Casselman Mine", "Corsa Coal", "Garrett County", "Kevin Harrigan"], "summary": "Rosebud Mining Company acquired Maryland’s largest underground coal mine, the Casselman mine, from bankrupt Canadian firm Corsa Coal for $15 million, avoiding inheritance of numerous safety violation fines. Despite laying off 93 employees, Rosebud rehired 50 former Corsa workers and will continue producing metallurgical coal at the site.", "content": "Maryland’s largest active underground coal mine changed hands last month after the mine’s previous operator, Canadian firm Corsa Coal, filed for bankruptcy and auctioned assets to pay creditors.\nThe new operator, Pennsylvania-based Rosebud Mining Company, will not inherit the dozens of delinquent fines levied by the federal Mine Safety and Health Administration (MSHA) for safety violations at the Casselman mine in Garrett County, Maryland.\nA Western District of Pennsylvania Bankruptcy Court judge approved a $15 million bid from Rosebud to acquire two underground mines in March, though Corsa’s creditors delayed finalizing the sale in hopes of attracting a higher bid.\nIn a declaration filed with the court in January, Corsa President Kevin Harrigan attributed his company’s financial troubles in part to an unpredictable market. “Economic uncertainty, inflationary pressures and corresponding monetary policy controls” pushed coal prices below Corsa’s mining costs in 2024, Harrigan wrote, straining the company’s ability to cover looming debt payments.\nCorsa did not respond to a Capital News Service request for comment by press time.\nThe company issued layoff notices to 93 employees at the Casselman mine on March 13 – a majority of the more than 100 people working at the mine as of 2024, according to MSHA records.\nRosebud hired 50 former Corsa employees after the acquisition, most of whom remain at the Casselman mine.\nThe mine produced roughly 660,000 tons of coal in 2023 – a relatively small output compared to the largest mines in neighboring Pennsylvania and West Virginia, but more than twice the output of the next-largest mine in Maryland in the same year.\nThe Casselman mine yields metallurgical coal, used to heat blast furnaces for steel production.\nWhile the market for thermal coal, used to generate electricity, has dwindled in the face of competition from cheap natural gas and renewable energy sources, the metallurgical coal market is relatively insulated from those pressures.\n“There is still a very strong need for metallurgical coal,” said Allegany Coal & Land Co. President Steve Jenkins, whose western Maryland company leases property to small coal operators.\nAnd although coal is not a renewable resource, Jenkins noted that Maryland’s coal seams are far from expended. “It’s just a matter of how much is accessible in the regulatory environment,” he said.\nBut like any commodity, the metallurgical coal market experiences price fluctuations, including an ongoing supply imbalance that pushed prices below Corsa’s mining costs.\nHarrigan’s declaration makes no mention of delinquent MSHA fines, and the total amount left unpaid to the agency – just under $25,000 – is relatively minor compared to other obligations, including $21.3 million in debts acquired by purchasing or leasing mining equipment, parts and fuel.\nThose unpaid fines stem from a range of safety violations, including several flagged by MSHA as “reasonably likely to result in a serious injury or illness.”\nIn October 2024, for instance, MSHA inspectors issued a $5,000 fine to the Corsa subsidiary operating the Casselman mine for allowing coal dust to accumulate, creating a fire or explosion hazard – one of more than 80 fines issued to the operator for the same violation since 2019, records show.\nOn the same day, inspectors also fined the company $2,400 for failing to provide adequate firefighting infrastructure for Casselman miners. Both fines remain delinquent, although Corsa paid other fines issued later the same year.\nA bankruptcy attorney representing Corsa did not respond to a CNS inquiry about why those delinquent fines were not listed as liabilities in the company’s initial bankruptcy filing.\nBut Wes Addington, executive director of the Appalachian Citizens’ Law Center, said MSHA doesn’t pursue unpaid fines as aggressively as other federal regulatory agencies. The center is a nonprofit law firm based in Whitesburg, Kentucky, that represents coal miners and their families on black lung and safety cases and advocates on environmental issues related to coal extraction in the region.\n“I’m skeptical (about) how much energy the government is going to put into trying to collect those fines,” he said, given MSHA’s track record of allowing mines to continue operating with thousands of dollars in delinquent safety violation fines.\nThe change in ownership at the Casselman mine comes as some mine safety advocates like Addington raise alarms about the risks created by an increasingly feeble MSHA.\nAn analysis of public data published by the Appalachian Citizens’ Law Center in March indicates that MSHA has lost roughly half of its coal mine inspection staff in the past decade.\nFederal law requires the agency to inspect surface mines at least twice and underground mines at least four times annually.\nTony Oppegard, a former mine inspector who previously served as an adviser to the MSHA administrator under President Bill Clinton, told Capital News Service that he doubts the agency will be held to those standards in the current political climate.\n“In years past, if MSHA was having a hard time making their twos and fours, there would generally be an oversight committee in the House and or the Senate who would call them in and want an explanation,” he said. “With the current Congress, I don’t know if they’d even care.”\nThe Trump administration’s decision in March to close dozens of MSHA field offices, including several in Pennsylvania and West Virginia, compounded those concerns. \n“Consolidating offices will reduce emergency response efficiency by placing inspectors farther from mining sites, making it more difficult for them to respond quickly in the event of a mine disaster,” said Erin Bates, the communications director for the United Mine Workers of America. “With an already limited workforce, stretching inspectors even thinner will reduce oversight effectiveness and compromise miner safety.”\nWorkers at the Casselman mine are not unionized, and Maryland mines are served by an MSHA office in Morgantown, West Virginia that is not slated for closure."}]
