{
  "Talbot": "Skip to content\nTalbot County Public Schools -\nCareers\nCalendar\nStudents/Families\nEmployees\nPowerSchool\nOKTA Login\nSEARCH SITE\nMENU\nSCHOOLS\nTRANSLATE\nTALBOT COUNTY PUBLIC SCHOOLSABOUTBOARD OF EDUCATIONBOARD OF EDUCATION\nBoard of Education\nBoard of Education\nPolicies\nBoard Meeting Information\nCitizens Advisory Committee\nBoard of Education\n\nThe Board of Education holds monthly meetings and work sessions throughout the year. Meeting agendas, minutes, supporting documents and archived meeting videos are available.  Board Work Sessions are generally held on the third Monday of the month at 5:30 p.m.   The general meetings are held on the following Wednesday at 7:00 p.m.  Board of Education meetings are held at the Talbot County Education Center at 12 Magnolia St., Easton, MD, and the public is invited and encouraged to attend.\n\nTo access information contained in the new TCPS Diligent Community Portal (formerly known as “Board Docs”), please follow the prompts indicated below:  \n\nGo to the TCPS website\n\nChoose “About” (far left column)\n\nChoose “Board Meeting Information” (item 3)\n\nIn this location, you will find a variety of information including SY 2025/26 Board Meeting dates, agendas and minutes, the link to live stream regular Board meetings, and the electronic form to request to speak at a meeting. \n\nAlso on the main page is a link to “Subscribe” to receive the agendas for Board Work Sessions and Regular Board Meetings.  \n\nRecordings for our July and August 2024 Board Meetings are linked below.\n\nLink to July Board of Education Meeting Agenda\n\nLink to July 17, 2024 Board of Education Meeting Video Recording\n\nLink to August Board of Education Meeting Agenda\n\nLink to August 14, 2024 Board of Education Meeting Video Recording\n\nPlease direct any questions you may have to Faith Brundige, Executive Assistant to the Superintendent, at Email Faith Brundige or 410-822-0330.\n\nBoard Meeting Agendas, Minutes & Videos\nBoard Meeting Info Prior to July 2024\nCitizens Advisory Committee\nEmily Jackson - President - District 4\n\nMrs. Jackson is a resident of Wye Mills. A mother of four, her school-aged children currently attend Talbot County Public Schools. She is an established professional family and newborn photographer with a studio on the Eastern Shore. Her aspiration and enthusiasm for civic responsibility and leadership began early in her life at Northeastern University in Boston, Massachusetts. She has worked on Capitol Hill, for the American Public Works Association, for the University of Maryland, and a variety of grassroots philanthropic organizations in fundraising and development.\n\nEmail Emily Jackson\n\nAmy Dodson - Vice President - District 3\n\nMrs. Amy Dodson, originally from North Carolina, has lived in Maryland since 1998. Her husband, Scott Dodson, is a native of the Eastern Shore and a 24-year teaching veteran. They have resided in Easton since 2013 and have three sons who are enrolled in Talbot County Public Schools. Mrs. Dodson has a Bachelor of Science in Business from Chowan University, North Carolina. She works as a National Sales Director within the safety industry, with advanced knowledge of confined space air quality and associated contaminates. Mrs. Dodson’s youngest son has Down Syndrome, and she has been involved in Down Syndrome advocacy since his birth. She is passionate about success for all students.\n\nEmail Amy Dodson\n\nDyshekia W. M. Strawberry - District 1\n\nMs. Strawberry is a dedicated healthcare professional with over 15 years of experience in patient care, nursing leadership and nursing education. She holds a Bachelor of Science in Nursing from Hampton University, a Master of Science in Nursing, Adult and Community Health from Wesley College, and a Post Masters Certificate in Nurse Leadership from Wilmington University. In addition to her work in nursing leadership Ms. Strawberry is an adjunct professor and mentor for nursing students at the University of Maryland Global Campus.  She is an entrepreneur, successfully managing independent businesses as a delegating nurse and as a real estate investor. She is a member of the American and Maryland Nurses Associations, and has served on committees, performed research, and delivered presentations focused on a broad range of health care initiatives. A resident of Easton, she is the proud parent of two children who attend Talbot County Public Schools.\n\nEmail Dyshekia Strawberry\n\nAnn O'Connor - District 2\n\nAnn O’Connor and her husband Jim and have lived in Talbot County for 18 years. They have six children, all of whom have attended TCPS. Three are in college and three are still in the system; one at Easton Middle School, and two at Easton High school. Ms. O’Connor earned a Bachelor of Arts in International Relations and Spanish from Syracuse University, and Master of Arts in Spanish from Middlebury College in Vermont. She has taught in private school, public school, and college and ran a Baby Bilingual Program in three preschools in Talbot County. As a parent volunteer, she was instrumental in getting the Gifted and Talented Program started at TCPS in 2014. She has led Destination Imagination teams, served on the Citizens Advisory Committee, has been a PTO member for many years, and co-chaired the Easton Middle School Friday Night Basketball Program.\n\nEmail Ann O'Connor\n\nKarla Wieland-Cherry - District 5\n\nKarla Wieland-Cherry has been a Real Estate Associate Broker with Meredith Fine Properties for 19 years, and she is a Registered Nurse with 30 years experience in Public Health and Hospice care. She has multiple certifications in both fields of work. She is an avid volunteer in many community programs including Trappe Volunteer Fire Dept, Friends of Hospice/Festival of Trees, Talbot County 4-H, Girl and Boy Scouts, Waterfowl Festival, Talbot Humane, Snip and Tuck TNR, Talbot Arts Council and St.Marks Church. She was past President of White Marsh Elementary PTO, St. Michael's Band Boosters and a member of the Board of Education Citizens Advisory Committee. She has an Associate Degree in Business from Chesapeake College and an Associate of Science in Nursing from Wor-Wic Community College. She is currently working on a Bachelor's Degree in Gerontology and minor in Business at University of Maryland Global Campus. Ms. Wieland-Cherry resides on a farm in Trappe with her husband, David who is a 5th grade teacher in Queen Anne's County. They live with 24 rescue cats, 2 ponies, chickens and 1 dog. They are proud parents of Talbot County graduates. Their daughter Katelynn is a graduate of Peabody Conservatory at Johns Hopkins University and currently finishing a Masters in Vocal Performance in Opera at Manhattan School of Music. Their son Joshua is a professional Firefighter and EMT with Prince George's County Fire Department.\n\nEmail Karla Wieland-Cherry\n\nCynthia M. Jurrius - District 6\n\nCynthia Jurrius has been an active member of the Talbot County community for more than 27 years. She brings seasoned professional experience from the non-profit, government, and private sectors, with a background in mediation and law. As a part of that work, she has launched and supported innovative and cost-effective school and community-based conflict resolution partnerships. She currently serves as the Director of the Mediation and Conflict Resolution Office of the Maryland Judiciary. Ms. Jurrius comes from a family of educators and sees excellent public schools as an essential foundation of a thriving community. She and her husband have three grown sons, all graduates of Talbot County Public Schools. She is a graduate of Lehigh University (B.A.) and George Washington University (J.D.).\n\nEmail Cynthia Jurrius\n\nDeborah Bridges - District 7\n\nHaving grown up in an Air Force family, Mrs. Deborah Bridges moved to Talbot County with her family in the 1970s. A St. Michaels High School graduate, she is actively involved in the local community. She owned and operated Swan Cove Flowers for more than 38 years before recently selling the business. Mrs. Bridges has taught floral design at Chesapeake College and worked as a bookkeeper for several local businesses. She is the President of Holly Lake Enterprises, Inc., and the Garden Center Manager of Bridges Land Management, Inc. Mrs. Bridges is married to Edward M. Bridges, Jr., and they have two sons, Eric and Marc Bridges, two wonderful daughters-in-law, and five grandchildren.\n\nEmail Deborah Bridges\n\nElmer Pineda - EHS Student Board Member\n\nTyler Murphy - SMMHS Student Board Member\n\nFind Us\n\nTalbot County Public Schools\n12 Magnolia Street\nEaston, MD 21601\nPhone: 410-822-0330\n\nSchools\nTalbot County Public Schools\nChapel District Elementary\nEaston Elementary\nSt. Michaels Elementary\nTilghman Elementary\nWhite Marsh Elementary\nEaston High\nEaston Middle\nSt. Michaels Middle High\nStay Connected\n\nInquiries about Title IX may be referred to Talbot County Public Schools’ Title IX Coordinator, the U.S. Department of Education’s Office for Civil Rights, or both. \n\nTalbot County Public Schools’ nondiscrimination policy and grievance procedures can be located on the school system’s website (www.tcps.k12.md.us).\nTo report information about conduct that may constitute sex discrimination or make a complaint of sex discrimination under Title IX, please refer to the contact listed above.\n\nCopyright © 2025 Talbot County Public Schools. All rights reserved.\nPowered By Apptegy\nVisit us to learn more",
  "Kent": "Server Error\n404 - File or directory not found.\nThe resource you are looking for might have been removed, had its name changed, or is temporarily unavailable.",
  "Dorchester": "Skip to content\nDorchester County Public Schools -\nCalendar\nEmployees\nParents/Students\nPowerschool\nSEARCH SITE\nMENU\nSCHOOLS\nTRANSLATE\nSIGN IN\nDORCHESTER COUNTY PUBLIC SCHOOLSLEADERSHIPBOARD OF EDUCATION\nBoard of Education\nBoard of Education\nBoard Clips\nBoard Docs\nBoard of Education Ongoing Data Dashboard\nOur Mission\n\nMission Statement\n\nThe Mission of DCPS is to implement immediate and effective measures to close achievement gaps and promote equity.  By implementing strategies and removing systemic barriers, all students will develop intellectual curiosity and skills to complete their Program of Study.\n\nOur Vision\n\nVision Statement\n\nDorchester County Public Schools will empower students to reach their fullest potential by encouraging them to incorporate ideals and skills through equitable opportunities to become lifelong learners and productive members of society.\n\nMaryland Association of Board of Education\n\nMinutes & Agendas\n\nBoard Clips\n\nRepresentatives\nMeeting Dates & Times\nBudgets & Financial Statements\nFind Us\n\nDorchester County Public Schools\n700 Glasgow Street\nCambridge, Maryland 21613\n410-228-4747\n410-228-1847\n\nwebmaster@dcpsmd.org\nStay Connected\n\nThe Board of Education of Dorchester County does not discriminate in admissions, access, treatment, or employment in its programs and activities on the basis of race, color, age, sex, national origin, religion, disability, sexual orientation or other basis prohibited by law.\n\nAppropriate accommodations for individuals with disabilities will be provided upon request. The information in this announcement is available in alternative formats upon request.\n\nCopyright © 2025 Dorchester County Public Schools. All rights reserved.\nPowered By Apptegy\nVisit us to learn more",
  "Caroline": "Skip to content\nCaroline County Public Schools -\nMENU\nSCHOOLS\nTRANSLATE\nSEARCH SITE\nSIGN IN\nError: 404\nPage not found\n\nPage not found\n\nReturn home\nFind Us\n\nCaroline County Public Schools\n204 Franklin Street\nDenton, MD 21629\nPhone: 410.479.1460\nFax: 410.479.0108\n\nSupport Services Center\n11348 Greensboro Road\nDenton, MD 21629\nPhone: 410.479.1210\nFax: 410.479.2741\n\nSchools\nCaroline County Public Schools\nDenton Elementary School\nFederalsburg Elementary School\nGreensboro Elementary School\nPreston Elementary School\nRidgely Elementary School\nColonel Richardson Middle School\nLockerman Middle School\nCaroline Career & Technology Center\nColonel Richardson High School\nNorth Caroline High School\nStay Connected\n\nThe Board of Education of Caroline County  does not discriminate in admissions, access, treatment, or employment in its programs and activities on the basis of race, color, age, sex, national origin, religion, disability, sexual orientation or other basis prohibited by law. Appropriate accommodations for individuals with disabilities will be provided upon request. The information in this announcement is available in alternative formats upon request.\n\nTitle IX Coordinator: Robert Willoughby, Supervisor of Human Resources | 410-479-1460 | willoughby.robert@ccpsstaff.org\n\n504 Coordinator: Christal Harkowa, Supervisor of Instruction | 410-479-1460 | harkowa.christal@ccpsstaff.org\n\nCopyright © 2025 Caroline County Public Schools. All rights reserved.\nPowered By Apptegy\nVisit us to learn more",
  "Queen Anne's": "Skip to content\n English\nSEARCH FOR:\n \nSearch\nJoin Our Team\nSubscribe\nContact\nQACPS News\nABOUT\nSAFETY & SECURITY\nACADEMICS\nSTUDENT SUPPORT SERVICES\nSTAFF\nSCHOOLS\nQAC GOES PURPLE\nPARENT RESOURCES\nSCHOOL CALENDAR\nSCHOOL MEALS\nPOWERSCHOOL\nSCHOOL REGISTRATION\nFLYERS\nBoard of Education\nat Queen Anne's County Public Schools\nWELCOME TO THE QUEEN ANNE’S COUNTY BOARD OF EDUCATION!\n\nBoard of Education Handbook\n\nBOARD MEMBERS\n\nThe members of the Board of Education of Queen Anne’s County are publicly elected. Policies set by the Board are administered by the Superintendent of Schools, who serves as the Executive Officer of the Board. Board Members attend all public sessions of the Board. Special sessions are held as needed.\n\nTo contact a board member, please write to:\n\nQueen Anne’s County Board of Education\n115 Vincit Street\nCentreville, Maryland 21617\n\nEmail addresses for each Board Member are also provided below.\n\n\n\nShannon Bent\nBoard President\nDistrict 1\n2022 – 2026\nshannon.bent@qacps.org\n\nAlexis Capes\nBoard Vice President\n2022 – 2026\nalexis.capes@qacps.org\n\nMathew Drayer\nBoard Member\nDistrict 2\n2024 – 2028\nmathew.drayer@qacps.org\n\nCarrie Sutherland\nBoard Member\nDistrict 3\n2024 – 2028\ncarrie.sutherland@qacps.org\n\nKendra Eichler\nBoard Member\nDistrict 4\n2024 – 2028\nkendra.eichler@qacps.org\n\n2025-2026 Student Board Members:\nKent Island High School: Reef Adams\nQueen Anne’s County High School: Thomas Mutchler\n\nSUPERINTENDENT & LEADERSHIP\n\nDr. Matthew Kibler\nInterim Superintendent\nmatthew.kibler@qacps.org\n\nDr. Jennifer Schrecongost\nInterim Assistant Superintendent\njennifer.schrecongost@qacps.org\n\nSid Pinder, Jr.\nChief Operating Officer\nsid.pinder@qacps.org\n\nDr. Michael Noel\nDirector of Human Resources\nmichael.noel@qacps.org\n\nRob Watkins\nInterim Chief Financial Officer\nrobert.watkins@qacps.org\n\nBOARD MEETINGS\n\n\nThe School Board Agenda is created by the Superintendent and approved by the Board President. Individuals may request a specific topic be added to the formal agenda. Requests should be made to the Superintendent of Schools (matthew.kibler@qacps.org) at least two weeks prior to the scheduled meeting.\n\nMEETING SCHEDULE\n\nCitizens may attend meetings in person or view a live stream. Live streams are available on the QACTV Facebook page, qac.org/live, and ABB Cable Channel 7. Recordings of past meetings are also available on the QACPS YouTube channel.\n\nClosed Sessions start at 4:00 or 4:30 p.m.\nBoard of Education Meetings (1st Wednesday of each month) start at 6:00 p.m.\nWork Sessions (scheduled as necessary and advertised prior) start at 5:00 p.m.\nBudget Work Sessions (typically held in January and February) start at 4:30 p.m.\nAll dates and times are subject to change; please check the website or call Kari Denis at (240) 913-9696, Ext. 122 to confirm.\nMeetings take place at the QACPS Board of Education Building (115 Vincit Street, Centreville, MD 21617)\n2025 – 2026 BOARD MEETING SCHEDULE\nCITIZEN PARTICIPATION\n\nQueen Anne’s County citizens are encouraged to attend Board meetings and may address the Board at the beginning of each meeting during the “Open Forum.”\n\nIf you are unable to attend the monthly board meeting in person, please submit your statement to communitycomments@qacps.org. Please keep in mind all comments must be under three minutes in length and follow the guidelines established by the QAC BOE.\n\nGuidelines for speaking during regular monthly Board meetings:\n\nSpeakers should sign the roster including their telephone number and address.\nComments should be limited to three minutes in length.  Comments longer than three minutes should be submitted in writing.\nStatements to the Board should relate to a matter of general policy over which the Board has authority.\nComments about actions or statements of individual staff members are not appropriate for Public Comment and should be referred to the Superintendent of Schools or Board President.\n\nIf you have a specific question, the Board will make sure an appropriate staff member responds to your question. The Board respects your desire and right to convey your message freely but asks as a courtesy to this Board and our citizens to show respect for all.\n\nMONTHLY MEETING NEWSLETTER\nRecap Newsletter of Past Board Meetings\nBOARDDOCS\n\nQACPS posts all Board meeting agendas, supplementary documents, and meeting minutes on BoardDocs. \n\nBOARDDOCS\nAPPEALS GUIDE\n\nThe purpose of the Appeals Guide is to provide the rules of procedure for all appeals to the Board of Education of Queen Anne’s County. \n\nQACPS APPEALS GUIDE\nETHICS & POLICY PANEL\n\nThe Queen Anne’s County Board of Education has adopted regulations for the purpose of defining and prohibiting certain conflicts; defining gifts and requiring financial disclosure; regulating and requiring reporting of certain lobbying activities, and creating a Queen Anne’s County School System Ethics Panel.\n\nContact the Ethics Panel\n\nQueen Anne’s County Board of Education\nc/o Kari Denis, Executive Secretary\n115 Vincit Street\nCentreville, MD 21617\nContact: kari.denis@qacps.org | (240) 913-9696, Ext. 122\nFour Year Policy Calendar Review\n\nEthics Panel Members\n\nNicholas Deoudes – Term Expires June 30, 2028\n\nDavid Simison – Term Expires June 30, 2026\n\nWilliam Daley – Term Expires June 30, 2027\n\nEthics Policy\n\nRegulation for Code of Ethics and Conflict of Interest\n\nQACPS Financial Disclosure Short Form\n\nQACPS Financial Disclosure Long Form\n\nEthics Complaint Reporting Form Template\n\nCITIZEN ADVISORY COMMITTEES\n\nEducation Article §4–112 requires that each county board establish at least one citizen advisory committee.  The Queen Anne’s County Board of Education believes that the school system is strengthened when community members are actively engaged.  Citizen advisory committees are an effective means for the board to be advised on matters including but not limited to: policy review, school calendar, system data review, budget, strategic plan review, and the review of the implementation of the Blueprint for Maryland’s Future in Queen Anne’s County.\n\n\nQACPS has both a Citizens Advisory Council (CAC) and a School System Improvement Committee (SSIC) that it operates under the Citizens Advisory Committees Policy and accompanying Regulation.  The CAC is made up of one parent or guardian from each school, five board appointed community members, a board member, and the superintendent’s designee who facilitates the meetings.  The SSIC is made up of one teacher representative from each school, three administrators, a board member, and the superintendent’s designee.  The committees each meet six times per year.\n\n\n\n\n\nMeeting Dates for the 2025-2026 School Year:\n\nOctober 8 – Agenda and Minutes\nNovember 12\nJanuary 14\nFebruary 18\nMarch 11\nApril 15\n\n\nAll SSIC meetings begin at 4:15 pm and the CAC meetings begin at 6:00 pm.\n\n\n2024-2025 Meetings\n2023-2024 Meetings\n\n\nPlease reach out to Dr. Jennifer Schrecongost, jennifer.schrecongost@qacps.org, if you have additional questions about the Citizen Advisory Committees.\n\n\nThe Special Education Department also has a Special Education Citizens’ Advisory Committee.  More information on that committee can be found on the Special Education webpage.\n\nBUDGET CALENDAR\n\nThe budget cycle for QACPS takes place over several months. Budget meetings are open to the public. Additional information is available in BoardDocs.\n\nFY 2024 – 2025 Budget Development Calendar\n\nSHARE THIS:\nBack to Top\n\n115 Vincit Street, Centreville, MD 21617\nTEL: (240) 913-9696\nMonday – Friday | 8:00 AM – 4:30 PM\n\nEmployee inquiries or complaints regarding discrimination or Title IX issues such as gender equity, sexual harassment and sexual discrimination should be directed to Michael Noel, Director of Human Resources, michael.noel@qacps.org or (240) 913-9696 ext. 118. Student or parent inquiries or complaints regarding discrimination or Title IX issues such as gender equity, sexual harassment and sexual discrimination should be directed to Matt Evans, Director of Student Services, starke.evans@qacps.org or (240) 913-9696 ext. 196. Inquiries regarding ADA and Section 504 should be directed to Joeleen Smith, Supervisor of Special Education, joeleen.smith@qacps.org or (240) 913-9696 ext. 168. Inquiries regarding Title II should be directed to Michael Noel, Director of Human Resources, michael.noel@qacps.org or (240) 913-9696 ext. 118. Inquiries may also be addressed in writing to the appropriate office at Queen Anne’s County Public Schools, 115 Vincit Street, Centreville, MD 21617.\n\nU.S. Department of Education Office of Inspector General Fraud Reporting Hotline\n\nThe OIG Hotline is available for anyone who knows of or suspects fraud, waste, abuse, mismanagement, or violations of laws and regulations involving U.S. Department of Education funds or programs. This includes allegations of suspected wrongdoing by Department employees, contractors, grantees, schools and school officials, persons in positions of trust involving Department funds or programs, collection agencies, recipients of student financial assistance, or lending institutions. OIG hotline: https://oig.ed.gov/oig-hotline"
}